#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_BreakableBlock_Spine.BP_BreakableBlock_Spine_C.OnBreak
struct ABP_BreakableBlock_Spine_C_OnBreak_Params
{
};

// Function BP_BreakableBlock_Spine.BP_BreakableBlock_Spine_C.BndEvt__HPComponent_K2Node_ComponentBoundEvent_0_HPDamageEvent__DelegateSignature
struct ABP_BreakableBlock_Spine_C_BndEvt__HPComponent_K2Node_ComponentBoundEvent_0_HPDamageEvent__DelegateSignature_Params
{
	class AActor*                                      From;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Damage;                                                    // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_BreakableBlock_Spine.BP_BreakableBlock_Spine_C.ReceiveBeginPlay
struct ABP_BreakableBlock_Spine_C_ReceiveBeginPlay_Params
{
};

// Function BP_BreakableBlock_Spine.BP_BreakableBlock_Spine_C.OnAttackLevelInsufficient
struct ABP_BreakableBlock_Spine_C_OnAttackLevelInsufficient_Params
{
	int                                                AttackLevel;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                NecessaryAttackLevel;                                      // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_BreakableBlock_Spine.BP_BreakableBlock_Spine_C.PostBreakDestroy
struct ABP_BreakableBlock_Spine_C_PostBreakDestroy_Params
{
};

// Function BP_BreakableBlock_Spine.BP_BreakableBlock_Spine_C.ExecuteUbergraph_BP_BreakableBlock_Spine
struct ABP_BreakableBlock_Spine_C_ExecuteUbergraph_BP_BreakableBlock_Spine_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
