#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_Character_SpineBase.BP_Character_SpineBase_C.ComputeSortPriority
struct ABP_Character_SpineBase_C_ComputeSortPriority_Params
{
	int                                                SortPriority;                                              // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Character_SpineBase.BP_Character_SpineBase_C.BndEvt__FactionComponent_K2Node_ComponentBoundEvent_2_FactionEvent__DelegateSignature
struct ABP_Character_SpineBase_C_BndEvt__FactionComponent_K2Node_ComponentBoundEvent_2_FactionEvent__DelegateSignature_Params
{
};

// Function BP_Character_SpineBase.BP_Character_SpineBase_C.OnRefreshTranslucentSortPriority
struct ABP_Character_SpineBase_C_OnRefreshTranslucentSortPriority_Params
{
	int                                                NewTranslucentSortPriority;                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Character_SpineBase.BP_Character_SpineBase_C.OnRespawn
struct ABP_Character_SpineBase_C_OnRespawn_Params
{
};

// Function BP_Character_SpineBase.BP_Character_SpineBase_C.BndEvt__HPComponent_K2Node_ComponentBoundEvent_0_HPDamageEvent__DelegateSignature
struct ABP_Character_SpineBase_C_BndEvt__HPComponent_K2Node_ComponentBoundEvent_0_HPDamageEvent__DelegateSignature_Params
{
	class AActor*                                      From;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Damage;                                                    // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Character_SpineBase.BP_Character_SpineBase_C.ExecuteUbergraph_BP_Character_SpineBase
struct ABP_Character_SpineBase_C_ExecuteUbergraph_BP_Character_SpineBase_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
