#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_Interactable_Base.BP_Interactable_Base_C.LaunchSystemMessage
struct ABP_Interactable_Base_C_LaunchSystemMessage_Params
{
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.RefreshUIText
struct ABP_Interactable_Base_C_RefreshUIText_Params
{
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.ReceiveBeginPlay
struct ABP_Interactable_Base_C_ReceiveBeginPlay_Params
{
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.OnActivateInteractable
struct ABP_Interactable_Base_C_OnActivateInteractable_Params
{
	class APlayerController*                           Controller;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.OnDeactivateInteractable
struct ABP_Interactable_Base_C_OnDeactivateInteractable_Params
{
	class APlayerController*                           Controller;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.AddCommand
struct ABP_Interactable_Base_C_AddCommand_Params
{
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.RemoveCommand
struct ABP_Interactable_Base_C_RemoveCommand_Params
{
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.OnInteract
struct ABP_Interactable_Base_C_OnInteract_Params
{
	class APlayerController*                           Controller;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.BndEvt__BP_Interactable_Base_ClearableComponent_K2Node_ComponentBoundEvent_0_ClearableEvent__DelegateSignature
struct ABP_Interactable_Base_C_BndEvt__BP_Interactable_Base_ClearableComponent_K2Node_ComponentBoundEvent_0_ClearableEvent__DelegateSignature_Params
{
	bool                                               bAlreadyCleared;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function BP_Interactable_Base.BP_Interactable_Base_C.ExecuteUbergraph_BP_Interactable_Base
struct ABP_Interactable_Base_C_ExecuteUbergraph_BP_Interactable_Base_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
