#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function BP_UIComponent.BP_UIComponent_C.LaunchFloatingText
struct UBP_UIComponent_C_LaunchFloatingText_Params
{
	class UClass*                                      FloatingTextType;                                          // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FText                                       Text;                                                      // 0x0008(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function BP_UIComponent.BP_UIComponent_C.ReceiveBeginPlay
struct UBP_UIComponent_C_ReceiveBeginPlay_Params
{
};

// Function BP_UIComponent.BP_UIComponent_C.OnReceiveDamage
struct UBP_UIComponent_C_OnReceiveDamage_Params
{
	class AActor*                                      From;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Damage;                                                    // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_UIComponent.BP_UIComponent_C.OnFloatingTextFinished
struct UBP_UIComponent_C_OnFloatingTextFinished_Params
{
	class UUserWidget*                                 UserWidget;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_UIComponent.BP_UIComponent_C.OnReceiveHeal
struct UBP_UIComponent_C_OnReceiveHeal_Params
{
	class AActor*                                      From;                                                      // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int                                                Heal;                                                      // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_UIComponent.BP_UIComponent_C.ExecuteUbergraph_BP_UIComponent
struct UBP_UIComponent_C_ExecuteUbergraph_BP_UIComponent_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
