#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.AddValue
struct UWB_Settings_GammaSlider_C_AddValue_Params
{
	float                                              ValueToAdd;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.RefreshArrowsVisibility
struct UWB_Settings_GammaSlider_C_RefreshArrowsVisibility_Params
{
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.GetPercent_1
struct UWB_Settings_GammaSlider_C_GetPercent_1_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.GetValue
struct UWB_Settings_GammaSlider_C_GetValue_Params
{
	float                                              ReturnValue;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.OnFocusReceived
struct UWB_Settings_GammaSlider_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.BndEvt__GammaSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
struct UWB_Settings_GammaSlider_C_BndEvt__GammaSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.SetValue
struct UWB_Settings_GammaSlider_C_SetValue_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.RefreshDesign
struct UWB_Settings_GammaSlider_C_RefreshDesign_Params
{
	bool                                               bFocused;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UWB_Settings_GammaSlider_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.BndEvt__ButtonRight_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
struct UWB_Settings_GammaSlider_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.ExecuteUbergraph_WB_Settings_GammaSlider
struct UWB_Settings_GammaSlider_C_ExecuteUbergraph_WB_Settings_GammaSlider_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WB_Settings_GammaSlider.WB_Settings_GammaSlider_C.OnValueChanged__DelegateSignature
struct UWB_Settings_GammaSlider_C_OnValueChanged__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
