#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.OnPressContext
struct UWBP_Recollection_BossRush_C_OnPressContext_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0038(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.OnFocusReceived
struct UWBP_Recollection_BossRush_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.BndEvt__WBP_Recollection_BossRush_WBP_DefaultButton_BossRushStart_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UWBP_Recollection_BossRush_C_BndEvt__WBP_Recollection_BossRush_WBP_DefaultButton_BossRushStart_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.Construct
struct UWBP_Recollection_BossRush_C_Construct_Params
{
};

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.OnRequestResetRecords
struct UWBP_Recollection_BossRush_C_OnRequestResetRecords_Params
{
};

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.OnResetRecords_Confirm
struct UWBP_Recollection_BossRush_C_OnResetRecords_Confirm_Params
{
};

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.ExecuteUbergraph_WBP_Recollection_BossRush
struct UWBP_Recollection_BossRush_C_ExecuteUbergraph_WBP_Recollection_BossRush_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Recollection_BossRush.WBP_Recollection_BossRush_C.OnLaunchBossRush__DelegateSignature
struct UWBP_Recollection_BossRush_C_OnLaunchBossRush__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
