#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.AddValue
struct UWBP_Settings_Graphics_ResolutionScale_C_AddValue_Params
{
	float                                              ValueToAdd;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.RefreshPercentageValue
struct UWBP_Settings_Graphics_ResolutionScale_C_RefreshPercentageValue_Params
{
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.RefreshDesign
struct UWBP_Settings_Graphics_ResolutionScale_C_RefreshDesign_Params
{
	bool                                               bFocused;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.BndEvt__GammaSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
struct UWBP_Settings_Graphics_ResolutionScale_C_BndEvt__GammaSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.SetValue
struct UWBP_Settings_Graphics_ResolutionScale_C_SetValue_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
struct UWBP_Settings_Graphics_ResolutionScale_C_BndEvt__ButtonLeft_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.BndEvt__ButtonRight_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
struct UWBP_Settings_Graphics_ResolutionScale_C_BndEvt__ButtonRight_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
{
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.ExecuteUbergraph_WBP_Settings_Graphics_ResolutionScale
struct UWBP_Settings_Graphics_ResolutionScale_C_ExecuteUbergraph_WBP_Settings_Graphics_ResolutionScale_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Settings_Graphics_ResolutionScale.WBP_Settings_Graphics_ResolutionScale_C.OnValueChanged__DelegateSignature
struct UWBP_Settings_Graphics_ResolutionScale_C_OnValueChanged__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
