#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_Pause.WBP_Pause_C.SequenceEvent__ENTRYPOINTWBP_Pause_1
struct UWBP_Pause_C_SequenceEvent__ENTRYPOINTWBP_Pause_1_Params
{
};

// Function WBP_Pause.WBP_Pause_C.SetAudioSnapshotEnable
struct UWBP_Pause_C_SetAudioSnapshotEnable_Params
{
	bool                                               Enable;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Pause.WBP_Pause_C.SetBackToRestPointButtonState
struct UWBP_Pause_C_SetBackToRestPointButtonState_Params
{
};

// Function WBP_Pause.WBP_Pause_C.SetAchievementsButtonText
struct UWBP_Pause_C_SetAchievementsButtonText_Params
{
};

// Function WBP_Pause.WBP_Pause_C.UnlockNavigation
struct UWBP_Pause_C_UnlockNavigation_Params
{
};

// Function WBP_Pause.WBP_Pause_C.LockNavigation
struct UWBP_Pause_C_LockNavigation_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnPreviewKeyDown
struct UWBP_Pause_C_OnPreviewKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Pause.WBP_Pause_C.ToggleUIVisibility
struct UWBP_Pause_C_ToggleUIVisibility_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnPressContext
struct UWBP_Pause_C_OnPressContext_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0038(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Pause.WBP_Pause_C.OnKeyDown
struct UWBP_Pause_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Pause.WBP_Pause_C.OnPressCancel
struct UWBP_Pause_C_OnPressCancel_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0038(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Pause.WBP_Pause_C.OnFocusReceived
struct UWBP_Pause_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_066E292E42E788874C41348F56BD7AC1
struct UWBP_Pause_C_OnFinish_066E292E42E788874C41348F56BD7AC1_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_2071A4134BF576284BB5479CE7113EE2
struct UWBP_Pause_C_OnFinish_2071A4134BF576284BB5479CE7113EE2_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_066E292E42E788874C41348F03CA60C1
struct UWBP_Pause_C_OnFinish_066E292E42E788874C41348F03CA60C1_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_2071A4134BF576284BB5479CB26624E2
struct UWBP_Pause_C_OnFinish_2071A4134BF576284BB5479CB26624E2_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_066E292E42E788874C41348F1FD48603
struct UWBP_Pause_C_OnFinish_066E292E42E788874C41348F1FD48603_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_2071A4134BF576284BB5479CAE78C220
struct UWBP_Pause_C_OnFinish_2071A4134BF576284BB5479CAE78C220_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_066E292E42E788874C41348FBDDC33EB
struct UWBP_Pause_C_OnFinish_066E292E42E788874C41348FBDDC33EB_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_2071A4134BF576284BB5479C0C7077C8
struct UWBP_Pause_C_OnFinish_2071A4134BF576284BB5479C0C7077C8_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_066E292E42E788874C41348F43230270
struct UWBP_Pause_C_OnFinish_066E292E42E788874C41348F43230270_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_2071A4134BF576284BB5479CF28F4653
struct UWBP_Pause_C_OnFinish_2071A4134BF576284BB5479CF28F4653_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_2071A4134BF576284BB5479C93B89820
struct UWBP_Pause_C_OnFinish_2071A4134BF576284BB5479C93B89820_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnFinish_066E292E42E788874C41348F2214DC03
struct UWBP_Pause_C_OnFinish_066E292E42E788874C41348F2214DC03_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnHideAllUIAnimEvaluate
struct UWBP_Pause_C_OnHideAllUIAnimEvaluate_Params
{
};

// Function WBP_Pause.WBP_Pause_C.BndEvt__ReturnToTitle_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UWBP_Pause_C_BndEvt__ReturnToTitle_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Pause.WBP_Pause_C.BndEvt__QuitGame_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
struct UWBP_Pause_C_BndEvt__QuitGame_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Pause.WBP_Pause_C.BndEvt__GraphicSettings_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
struct UWBP_Pause_C_BndEvt__GraphicSettings_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Pause.WBP_Pause_C.OnSettingsClose
struct UWBP_Pause_C_OnSettingsClose_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnQuitGameClickYES
struct UWBP_Pause_C_OnQuitGameClickYES_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnQuitGameClickNO
struct UWBP_Pause_C_OnQuitGameClickNO_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnReturnTitleClickYES
struct UWBP_Pause_C_OnReturnTitleClickYES_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnReturnTitleClickNO
struct UWBP_Pause_C_OnReturnTitleClickNO_Params
{
};

// Function WBP_Pause.WBP_Pause_C.Construct
struct UWBP_Pause_C_Construct_Params
{
};

// Function WBP_Pause.WBP_Pause_C.ResumeGame
struct UWBP_Pause_C_ResumeGame_Params
{
};

// Function WBP_Pause.WBP_Pause_C.ForceClose
struct UWBP_Pause_C_ForceClose_Params
{
};

// Function WBP_Pause.WBP_Pause_C.BndEvt__Continue_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
struct UWBP_Pause_C_BndEvt__Continue_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Pause.WBP_Pause_C.BndEvt__Achievements_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
struct UWBP_Pause_C_BndEvt__Achievements_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Pause.WBP_Pause_C.OnAchievementsClose
struct UWBP_Pause_C_OnAchievementsClose_Params
{
};

// Function WBP_Pause.WBP_Pause_C.WidgetAnimationEvt_HideAllUI_K2Node_WidgetAnimationEvent_1
struct UWBP_Pause_C_WidgetAnimationEvt_HideAllUI_K2Node_WidgetAnimationEvent_1_Params
{
};

// Function WBP_Pause.WBP_Pause_C.BndEvt__BackToRestpoint_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
struct UWBP_Pause_C_BndEvt__BackToRestpoint_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Pause.WBP_Pause_C.OnBackToRestpointYES
struct UWBP_Pause_C_OnBackToRestpointYES_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnBackToRestpointNO
struct UWBP_Pause_C_OnBackToRestpointNO_Params
{
};

// Function WBP_Pause.WBP_Pause_C.Destruct
struct UWBP_Pause_C_Destruct_Params
{
};

// Function WBP_Pause.WBP_Pause_C.OnRemovedFromFocusPath
struct UWBP_Pause_C_OnRemovedFromFocusPath_Params
{
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function WBP_Pause.WBP_Pause_C.OnFadeFinished
struct UWBP_Pause_C_OnFadeFinished_Params
{
};

// Function WBP_Pause.WBP_Pause_C.ExecuteUbergraph_WBP_Pause
struct UWBP_Pause_C_ExecuteUbergraph_WBP_Pause_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Pause.WBP_Pause_C.OnResumeGame__DelegateSignature
struct UWBP_Pause_C_OnResumeGame__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
