#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.SetInitialToggle
struct UWBP_DebugPage_Aptitude_C_SetInitialToggle_Params
{
	class UWBP_DebugMenuToggleEntry_C*                 ToggleEntry;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                         ItemData;                                                  // 0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.ToggleAptitude
struct UWBP_DebugPage_Aptitude_C_ToggleAptitude_Params
{
	class UWBP_DebugMenuToggleEntry_C*                 ToggleEntry;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                         ItemData;                                                  // 0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.OnFocusReceived
struct UWBP_DebugPage_Aptitude_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.Construct
struct UWBP_DebugPage_Aptitude_C_Construct_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__DoubleJump_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__DoubleJump_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__Dash_K2Node_ComponentBoundEvent_7_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__Dash_K2Node_ComponentBoundEvent_7_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__DashAttack_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__DashAttack_K2Node_ComponentBoundEvent_8_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__Dive_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__Dive_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__Dodge_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__Dodge_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__Hook_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__Hook_K2Node_ComponentBoundEvent_11_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__PoundAttack_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__PoundAttack_K2Node_ComponentBoundEvent_12_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__Wallgrab_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__Wallgrab_K2Node_ComponentBoundEvent_13_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.BndEvt__WBP_DebugPage_Aptitude_UnlockDoors_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature
struct UWBP_DebugPage_Aptitude_C_BndEvt__WBP_DebugPage_Aptitude_UnlockDoors_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Aptitude.WBP_DebugPage_Aptitude_C.ExecuteUbergraph_WBP_DebugPage_Aptitude
struct UWBP_DebugPage_Aptitude_C_ExecuteUbergraph_WBP_DebugPage_Aptitude_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
