#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnKeyDown
struct UWBP_DialogProfileChange_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnFocusReceived
struct UWBP_DialogProfileChange_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnFinish_066E292E42E788874C41348FEA270E86
struct UWBP_DialogProfileChange_C_OnFinish_066E292E42E788874C41348FEA270E86_Params
{
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnFinish_2071A4134BF576284BB5479C5B8B4AA5
struct UWBP_DialogProfileChange_C_OnFinish_2071A4134BF576284BB5479C5B8B4AA5_Params
{
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnFinish_066E292E42E788874C41348F621B212A
struct UWBP_DialogProfileChange_C_OnFinish_066E292E42E788874C41348F621B212A_Params
{
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnFinish_2071A4134BF576284BB5479CD3B76509
struct UWBP_DialogProfileChange_C_OnFinish_2071A4134BF576284BB5479CD3B76509_Params
{
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.BndEvt__Button_YES_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UWBP_DialogProfileChange_C_BndEvt__Button_YES_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.BndEvt__Button_NO_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
struct UWBP_DialogProfileChange_C_BndEvt__Button_NO_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.Construct
struct UWBP_DialogProfileChange_C_Construct_Params
{
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.ResumeGame
struct UWBP_DialogProfileChange_C_ResumeGame_Params
{
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnCurrentProfileChanged
struct UWBP_DialogProfileChange_C_OnCurrentProfileChanged_Params
{
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnCloseProfileUI
struct UWBP_DialogProfileChange_C_OnCloseProfileUI_Params
{
	bool                                               bValidSelection;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.ExecuteUbergraph_WBP_DialogProfileChange
struct UWBP_DialogProfileChange_C_ExecuteUbergraph_WBP_DialogProfileChange_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DialogProfileChange.WBP_DialogProfileChange_C.OnResumeGame__DelegateSignature
struct UWBP_DialogProfileChange_C_OnResumeGame__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
