#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.OnFocusReceived
struct UWBP_DebugPage_Default_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.Construct
struct UWBP_DebugPage_Default_C_Construct_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.BndEvt__SAVE_K2Node_ComponentBoundEvent_1_OnExecute__DelegateSignature
struct UWBP_DebugPage_Default_C_BndEvt__SAVE_K2Node_ComponentBoundEvent_1_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.BndEvt__UnlockAllSpirits_K2Node_ComponentBoundEvent_2_OnExecute__DelegateSignature
struct UWBP_DebugPage_Default_C_BndEvt__UnlockAllSpirits_K2Node_ComponentBoundEvent_2_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.BndEvt__UnlockAllPassives_K2Node_ComponentBoundEvent_3_OnExecute__DelegateSignature
struct UWBP_DebugPage_Default_C_BndEvt__UnlockAllPassives_K2Node_ComponentBoundEvent_3_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.BndEvt__TeleportMenu_K2Node_ComponentBoundEvent_4_OnExecute__DelegateSignature
struct UWBP_DebugPage_Default_C_BndEvt__TeleportMenu_K2Node_ComponentBoundEvent_4_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.OnCloseFastTravel
struct UWBP_DebugPage_Default_C_OnCloseFastTravel_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.OnRequestFastTravel
struct UWBP_DebugPage_Default_C_OnRequestFastTravel_Params
{
	struct FDataTableRowHandle                         GameMapHandle;                                             // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.BndEvt__UnlockAllTips_K2Node_ComponentBoundEvent_5_OnExecute__DelegateSignature
struct UWBP_DebugPage_Default_C_BndEvt__UnlockAllTips_K2Node_ComponentBoundEvent_5_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.BndEvt__OpenAllMaps_K2Node_ComponentBoundEvent_6_OnExecute__DelegateSignature
struct UWBP_DebugPage_Default_C_BndEvt__OpenAllMaps_K2Node_ComponentBoundEvent_6_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.BndEvt__EquipMenu_K2Node_ComponentBoundEvent_7_OnExecute__DelegateSignature
struct UWBP_DebugPage_Default_C_BndEvt__EquipMenu_K2Node_ComponentBoundEvent_7_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.OnCloseMainMenu
struct UWBP_DebugPage_Default_C_OnCloseMainMenu_Params
{
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.OnSaveFinished
struct UWBP_DebugPage_Default_C_OnSaveFinished_Params
{
	bool                                               bSuccess;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_DebugPage_Default.WBP_DebugPage_Default_C.ExecuteUbergraph_WBP_DebugPage_Default
struct UWBP_DebugPage_Default_C_ExecuteUbergraph_WBP_DebugPage_Default_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
