#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_Settings_Game.WBP_Settings_Game_C.OnFocusReceived
struct UWBP_Settings_Game_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.Construct
struct UWBP_Settings_Game_C_Construct_Params
{
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_DisplayDamageValues_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_DisplayDamageValues_K2Node_ComponentBoundEvent_0_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_DisplayHealValues_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_DisplayHealValues_K2Node_ComponentBoundEvent_1_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_EnableForceFeedback_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_EnableForceFeedback_K2Node_ComponentBoundEvent_2_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_EnableCameraShake_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_EnableCameraShake_K2Node_ComponentBoundEvent_3_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_EnableInternalAchievementNotification_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_EnableInternalAchievementNotification_K2Node_ComponentBoundEvent_4_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_HoldForSummonSetSwitch_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_HoldForSummonSetSwitch_K2Node_ComponentBoundEvent_5_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_DisplayPlayerUI_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_DisplayPlayerUI_K2Node_ComponentBoundEvent_6_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_DisplayEnemyFloatingGauges_K2Node_ComponentBoundEvent_7_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_DisplayEnemyFloatingGauges_K2Node_ComponentBoundEvent_7_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_Game_WBP_DefaultButton_ResetToDefault_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_Game_WBP_DefaultButton_ResetToDefault_K2Node_ComponentBoundEvent_8_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.InitializeValues
struct UWBP_Settings_Game_C_InitializeValues_Params
{
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_Game_WBP_Settings_EnableDamageAreaPostProcess_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_Game_WBP_Settings_EnableDamageAreaPostProcess_K2Node_ComponentBoundEvent_9_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.BndEvt__WBP_Settings_Game_WBP_Settings_NoAutoclimbWhilePressingDown_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature
struct UWBP_Settings_Game_C_BndEvt__WBP_Settings_Game_WBP_Settings_NoAutoclimbWhilePressingDown_K2Node_ComponentBoundEvent_10_OnToggle__DelegateSignature_Params
{
	bool                                               ToggleValue;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_Settings_Game.WBP_Settings_Game_C.ExecuteUbergraph_WBP_Settings_Game
struct UWBP_Settings_Game_C_ExecuteUbergraph_WBP_Settings_Game_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
