#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DialogNoController.WBP_DialogNoController_C.OnFocusReceived
struct UWBP_DialogNoController_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.OnFinish_066E292E42E788874C41348FA048AB13
struct UWBP_DialogNoController_C_OnFinish_066E292E42E788874C41348FA048AB13_Params
{
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.OnFinish_2071A4134BF576284BB5479C11E4EF30
struct UWBP_DialogNoController_C_OnFinish_2071A4134BF576284BB5479C11E4EF30_Params
{
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.OnFinish_066E292E42E788874C41348FECA9FE0F
struct UWBP_DialogNoController_C_OnFinish_066E292E42E788874C41348FECA9FE0F_Params
{
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.OnFinish_2071A4134BF576284BB5479C5D05BA2C
struct UWBP_DialogNoController_C_OnFinish_2071A4134BF576284BB5479C5D05BA2C_Params
{
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.Construct
struct UWBP_DialogNoController_C_Construct_Params
{
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.OnProfileSelected
struct UWBP_DialogNoController_C_OnProfileSelected_Params
{
	bool                                               bValidSelection;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.Close
struct UWBP_DialogNoController_C_Close_Params
{
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.BndEvt__Button_Resume_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UWBP_DialogNoController_C_BndEvt__Button_Resume_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.PreConstruct
struct UWBP_DialogNoController_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.ExecuteUbergraph_WBP_DialogNoController
struct UWBP_DialogNoController_C_ExecuteUbergraph_WBP_DialogNoController_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DialogNoController.WBP_DialogNoController_C.OnClose__DelegateSignature
struct UWBP_DialogNoController_C_OnClose__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
