#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.OnPressRight
struct UWBP_DebugMenuToggleEntry_C_OnPressRight_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0038(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.OnPressLeft
struct UWBP_DebugMenuToggleEntry_C_OnPressLeft_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0038(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.OnPressConfirm
struct UWBP_DebugMenuToggleEntry_C_OnPressConfirm_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0038(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.RefreshStatusText
struct UWBP_DebugMenuToggleEntry_C_RefreshStatusText_Params
{
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.Toggle
struct UWBP_DebugMenuToggleEntry_C_Toggle_Params
{
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.PreConstruct
struct UWBP_DebugMenuToggleEntry_C_PreConstruct_Params
{
	bool                                               IsDesignTime;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.RefreshDesign
struct UWBP_DebugMenuToggleEntry_C_RefreshDesign_Params
{
	bool                                               bFocused;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.Construct
struct UWBP_DebugMenuToggleEntry_C_Construct_Params
{
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.OnInitialized
struct UWBP_DebugMenuToggleEntry_C_OnInitialized_Params
{
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.SetToggleValue
struct UWBP_DebugMenuToggleEntry_C_SetToggleValue_Params
{
	bool                                               Value;                                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.ExecuteUbergraph_WBP_DebugMenuToggleEntry
struct UWBP_DebugMenuToggleEntry_C_ExecuteUbergraph_WBP_DebugMenuToggleEntry_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugMenuToggleEntry.WBP_DebugMenuToggleEntry_C.OnToggle__DelegateSignature
struct UWBP_DebugMenuToggleEntry_C_OnToggle__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
