#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.OnFocusReceived
struct UWBP_DebugPage_Params_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__DifficultyLevel_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__DifficultyLevel_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__PlayerLevel_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__PlayerLevel_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__HealCountLevel_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__HealCountLevel_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__HealPowerLevel_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__HealPowerLevel_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.Construct
struct UWBP_DebugPage_Params_C_Construct_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__WBP_DebugMenuButtonEntry_K2Node_ComponentBoundEvent_4_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__WBP_DebugMenuButtonEntry_K2Node_ComponentBoundEvent_4_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__AddHPUpLv2_K2Node_ComponentBoundEvent_5_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__AddHPUpLv2_K2Node_ComponentBoundEvent_5_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__AddHPUpLv3_K2Node_ComponentBoundEvent_6_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__AddHPUpLv3_K2Node_ComponentBoundEvent_6_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__AddSpiritCurrencyLv1_K2Node_ComponentBoundEvent_7_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__AddSpiritCurrencyLv1_K2Node_ComponentBoundEvent_7_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__AddSpiritCurrencyLv2_K2Node_ComponentBoundEvent_8_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__AddSpiritCurrencyLv2_K2Node_ComponentBoundEvent_8_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__RestoreAllHeals_K2Node_ComponentBoundEvent_9_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__RestoreAllHeals_K2Node_ComponentBoundEvent_9_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__HealPowerLevel_1_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__HealPowerLevel_1_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__AddSpiritCurrencyLv3_K2Node_ComponentBoundEvent_11_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__AddSpiritCurrencyLv3_K2Node_ComponentBoundEvent_11_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__PlayerSkinLevel_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__PlayerSkinLevel_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__WBP_DebugPage_Params_FinalPassivePartCount_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__WBP_DebugPage_Params_FinalPassivePartCount_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__WBP_DebugPage_Params_SimulateEndingA_K2Node_ComponentBoundEvent_14_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__WBP_DebugPage_Params_SimulateEndingA_K2Node_ComponentBoundEvent_14_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__WBP_DebugPage_Params_SimulateEndingB_K2Node_ComponentBoundEvent_15_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__WBP_DebugPage_Params_SimulateEndingB_K2Node_ComponentBoundEvent_15_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__WBP_DebugPage_Params_SimulateEndingC_K2Node_ComponentBoundEvent_16_OnExecute__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__WBP_DebugPage_Params_SimulateEndingC_K2Node_ComponentBoundEvent_16_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.BndEvt__WBP_DebugPage_Params_NGGeneration_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Params_C_BndEvt__WBP_DebugPage_Params_NGGeneration_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Params.WBP_DebugPage_Params_C.ExecuteUbergraph_WBP_DebugPage_Params
struct UWBP_DebugPage_Params_C_ExecuteUbergraph_WBP_DebugPage_Params_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
