#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DebugPage_Display.WBP_DebugPage_Display_C.OnFocusReceived
struct UWBP_DebugPage_Display_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DebugPage_Display.WBP_DebugPage_Display_C.BndEvt__WBP_DebugPage_Display_WBP_DebugMenuValueEntry_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
struct UWBP_DebugPage_Display_C_BndEvt__WBP_DebugPage_Display_WBP_DebugMenuValueEntry_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature_Params
{
	int                                                NewValue;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DebugPage_Display.WBP_DebugPage_Display_C.BndEvt__WBP_DebugPage_Display_HideUIA_K2Node_ComponentBoundEvent_2_OnExecute__DelegateSignature
struct UWBP_DebugPage_Display_C_BndEvt__WBP_DebugPage_Display_HideUIA_K2Node_ComponentBoundEvent_2_OnExecute__DelegateSignature_Params
{
};

// Function WBP_DebugPage_Display.WBP_DebugPage_Display_C.ExecuteUbergraph_WBP_DebugPage_Display
struct UWBP_DebugPage_Display_C_ExecuteUbergraph_WBP_DebugPage_Display_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
