#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnPressConfirm
struct UWBP_Settings_Gamma_C_OnPressConfirm_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                                 ReturnValue;                                               // 0x0038(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.GetText_1
struct UWBP_Settings_Gamma_C_GetText_1_Params
{
	struct FText                                       ReturnValue;                                               // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnFocusReceived
struct UWBP_Settings_Gamma_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnFinish_066E292E42E788874C41348F555FED74
struct UWBP_Settings_Gamma_C_OnFinish_066E292E42E788874C41348F555FED74_Params
{
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnFinish_2071A4134BF576284BB5479CE4F3A957
struct UWBP_Settings_Gamma_C_OnFinish_2071A4134BF576284BB5479CE4F3A957_Params
{
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnFinish_066E292E42E788874C41348FECB216C9
struct UWBP_Settings_Gamma_C_OnFinish_066E292E42E788874C41348FECB216C9_Params
{
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnFinish_2071A4134BF576284BB5479C5D1E52EA
struct UWBP_Settings_Gamma_C_OnFinish_2071A4134BF576284BB5479C5D1E52EA_Params
{
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.Construct
struct UWBP_Settings_Gamma_C_Construct_Params
{
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.Close
struct UWBP_Settings_Gamma_C_Close_Params
{
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.BndEvt__WB_Settings_GammaSlider_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
struct UWBP_Settings_Gamma_C_BndEvt__WB_Settings_GammaSlider_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature_Params
{
	float                                              Value;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnPressedConfirm
struct UWBP_Settings_Gamma_C_OnPressedConfirm_Params
{
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.ExecuteUbergraph_WBP_Settings_Gamma
struct UWBP_Settings_Gamma_C_ExecuteUbergraph_WBP_Settings_Gamma_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_Settings_Gamma.WBP_Settings_Gamma_C.OnClose__DelegateSignature
struct UWBP_Settings_Gamma_C_OnClose__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
