#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnKeyDown
struct UWBP_DialogYesNo_C_OnKeyDown_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                                   InKeyEvent;                                                // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                                 ReturnValue;                                               // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnFocusReceived
struct UWBP_DialogYesNo_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnFinish_066E292E42E788874C41348F04FA604E
struct UWBP_DialogYesNo_C_OnFinish_066E292E42E788874C41348F04FA604E_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnFinish_2071A4134BF576284BB5479CB556246D
struct UWBP_DialogYesNo_C_OnFinish_2071A4134BF576284BB5479CB556246D_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnFinish_066E292E42E788874C41348F962FFF6A
struct UWBP_DialogYesNo_C_OnFinish_066E292E42E788874C41348F962FFF6A_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnFinish_2071A4134BF576284BB5479C2783BB49
struct UWBP_DialogYesNo_C_OnFinish_2071A4134BF576284BB5479C2783BB49_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnFinish_066E292E42E788874C41348F9D4D0324
struct UWBP_DialogYesNo_C_OnFinish_066E292E42E788874C41348F9D4D0324_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnFinish_2071A4134BF576284BB5479C2CE14707
struct UWBP_DialogYesNo_C_OnFinish_2071A4134BF576284BB5479C2CE14707_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.BndEvt__Button_YES_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UWBP_DialogYesNo_C_BndEvt__Button_YES_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.BndEvt__Button_NO_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
struct UWBP_DialogYesNo_C_BndEvt__Button_NO_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.Construct
struct UWBP_DialogYesNo_C_Construct_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.SetTexts
struct UWBP_DialogYesNo_C_SetTexts_Params
{
	struct FText                                       MessageText;                                               // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FText                                       YESText;                                                   // 0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	struct FText                                       NOText;                                                    // 0x0030(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnPressCancelButton
struct UWBP_DialogYesNo_C_OnPressCancelButton_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.ExecuteUbergraph_WBP_DialogYesNo
struct UWBP_DialogYesNo_C_ExecuteUbergraph_WBP_DialogYesNo_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnClickNO__DelegateSignature
struct UWBP_DialogYesNo_C_OnClickNO__DelegateSignature_Params
{
};

// Function WBP_DialogYesNo.WBP_DialogYesNo_C.OnClickYES__DelegateSignature
struct UWBP_DialogYesNo_C_OnClickYES__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
