#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.SetupNewRecordFlag
struct UWBP_BossRush_Result_C_SetupNewRecordFlag_Params
{
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.OnFocusReceived
struct UWBP_BossRush_Result_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.OnFinish_066E292E42E788874C41348F5E2AAB7E
struct UWBP_BossRush_Result_C_OnFinish_066E292E42E788874C41348F5E2AAB7E_Params
{
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.OnFinish_2071A4134BF576284BB5479CEF86EF5D
struct UWBP_BossRush_Result_C_OnFinish_2071A4134BF576284BB5479CEF86EF5D_Params
{
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.OnFinish_066E292E42E788874C41348FB3F3602C
struct UWBP_BossRush_Result_C_OnFinish_066E292E42E788874C41348FB3F3602C_Params
{
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.OnFinish_2071A4134BF576284BB5479C025F240F
struct UWBP_BossRush_Result_C_OnFinish_2071A4134BF576284BB5479C025F240F_Params
{
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.Construct
struct UWBP_BossRush_Result_C_Construct_Params
{
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.BndEvt__BossRushResult_WBP_DefaultButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UWBP_BossRush_Result_C_BndEvt__BossRushResult_WBP_DefaultButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.ExecuteUbergraph_WBP_BossRush_Result
struct UWBP_BossRush_Result_C_ExecuteUbergraph_WBP_BossRush_Result_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_BossRush_Result.WBP_BossRush_Result_C.OnClose__DelegateSignature
struct UWBP_BossRush_Result_C_OnClose__DelegateSignature_Params
{
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
