#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Parameters
//---------------------------------------------------------------------------

// Function WBP_SettingEntry_Sound.WBP_SettingEntry_Sound_C.OnFocusReceived
struct UWBP_SettingEntry_Sound_C_OnFocusReceived_Params
{
	struct FGeometry                                   MyGeometry;                                                // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                                 InFocusEvent;                                              // 0x0038(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                                 ReturnValue;                                               // 0x0040(0x00B8)  (Parm, OutParm, ReturnParm)
};

// Function WBP_SettingEntry_Sound.WBP_SettingEntry_Sound_C.BndEvt__WBP_SettingEntry_Sound_WBP_DefaultButton_ResetToDefault_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UWBP_SettingEntry_Sound_C_BndEvt__WBP_SettingEntry_Sound_WBP_DefaultButton_ResetToDefault_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
	struct FKeyEvent                                   KeyEvent;                                                  // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_SettingEntry_Sound.WBP_SettingEntry_Sound_C.ExecuteUbergraph_WBP_SettingEntry_Sound
struct UWBP_SettingEntry_Sound_C_ExecuteUbergraph_WBP_SettingEntry_Sound_Params
{
	int                                                EntryPoint;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
