#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Zenith.ReusableActor
// 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
class AReusableActor : public AActor
{
public:
	unsigned char                                      UnknownData_UNQN[0x1];                                     // 0x0220(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	bool                                               bDeactivateOnBeginPlay;                                    // 0x0221(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bEnableCollisionOnActivate;                                // 0x0222(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_D1YM[0x5];                                     // 0x0223(0x0005) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.ReusableActor");
		return ptr;
	}



	void OnDeactivate();
	void OnActivate();
	bool IsActive();
	void Deactivate();
	void Activate();
};

// Class Zenith.Ability
// 0x00A0 (FullSize[0x02C8] - InheritedSize[0x0228])
class AAbility : public AReusableActor
{
public:
	unsigned char                                      UnknownData_KC1M[0x8];                                     // 0x0228(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UClass*>                              IgnoreIfTargetHasAnyState;                                 // 0x0230(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                              MaxExecutionTime;                                          // 0x0240(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bWarnLongExecutionTime;                                    // 0x0244(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bCanBeJustGuarded;                                         // 0x0245(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bCanBeJustDodged;                                          // 0x0246(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bCanBeParried;                                             // 0x0247(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ExecuteGotJustGuardedEvents;                               // 0x0248(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bExecuteGotJustGuardedEvents;                              // 0x0249(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bExecuteGotJustDodgedEvents;                               // 0x024A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bExecuteGotParriedEvents;                                  // 0x024B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bTriggerParryAbility;                                      // 0x024C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UQSZ[0x33];                                    // 0x024D(0x0033) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class AActor*                                      Invoker;                                                   // 0x0280(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Zenith_EAbilityType                                AbilityType;                                               // 0x0288(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_OL5Z[0x3F];                                    // 0x0289(0x003F) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.Ability");
		return ptr;
	}



	void Tick(float DeltaTime);
	void Stop(Zenith_EAbilityStopReason AbilityStopReason);
	void OnTick(float DeltaTime);
	void OnStop(Zenith_EAbilityStopReason AbilityStopReason);
	void OnLaunch();
	void OnInitialize();
	void Launch(class AActor* Invoker);
	bool IsLaunched();
	void Initialize();
	float GetMaxExecutionTime();
	class AActor* GetInvoker();
	float GetExecutionTime();
	Zenith_EAbilityType GetAbilityType();
	bool ExecuteAbilityEffectsOnTarget(class AActor* Target, const struct FHitInfos& HitInfos);
	bool CanTargetActor(class AActor* TargetActor, Zenith_EFaction FactionFilter, Zenith_EAbilityTargetTypes TargetType);
	bool CanLaunch();
};

// Class Zenith.AbilityComponent
// 0x0078 (FullSize[0x0128] - InheritedSize[0x00B0])
class UAbilityComponent : public UActorComponent
{
public:
	TArray<class AAbility*>                            RunningAbilities;                                          // 0x00B0(0x0010) (ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AAbility>>             RunningFireAndForgetAbilities;                             // 0x00C0(0x0010) (ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class UClass*, struct FObjectArray>           AvailableAbilities;                                        // 0x00D0(0x0050) (Transient, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_1XJL[0x8];                                     // 0x0120(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AbilityComponent");
		return ptr;
	}



	void StopAllAbilities(Zenith_EAbilityStopReason AbilityStopReason, bool bStopFireAndForgetAbilities);
	void StopAbility(class AAbility* Ability, Zenith_EAbilityStopReason AbilityStopReason);
	void OnGameMapSwitch();
	void OnDisposeAbility(class AAbility* Ability);
	class AAbility* LaunchAbilityFromDescription(const struct FAbilityDescription& AbilityDescription, const struct FTransform& Offset);
	class AAbility* LaunchAbilityAbsolute(class UClass* AbilityClass, const struct FAbilityParams& AbilityParameters, const struct FTransform& AbilityTransform, bool bFireAndForget);
	class AAbility* LaunchAbility(class UClass* AbilityClass, const struct FAbilityParams& AbilityParameters, const struct FTransform& Offset, SpineExtensionPlugin_ESpineBone SpawnBone, const struct FName& CustomSpawnBone, bool bFollowSpawnBoneRotation, SpineExtensionPlugin_ESpineBone AttachBone, const struct FName& CustomAttachBone, bool bFollowAttachBoneRotation, bool bFireAndForget);
};

// Class Zenith.AbilityContainer
// 0x0078 (FullSize[0x0340] - InheritedSize[0x02C8])
class AAbilityContainer : public AAbility
{
public:
	unsigned char                                      UnknownData_N9CS[0x8];                                     // 0x02C8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAbilityTimeline                            AbilityTimeline;                                           // 0x02D0(0x0060) (Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                               bAutoStop;                                                 // 0x0330(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_LMQP[0xF];                                     // 0x0331(0x000F) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AbilityContainer");
		return ptr;
	}



};

// Class Zenith.AbilityEffectComponent
// 0x0050 (FullSize[0x0100] - InheritedSize[0x00B0])
class UAbilityEffectComponent : public UActorComponent
{
public:
	bool                                               bActive;                                                   // 0x00B0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Zenith_EAbilityEffectQueue                         AbilityEffectQueue;                                        // 0x00B1(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bOnlyApplyIfTargetAlive;                                   // 0x00B2(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bOnlyApplyOnPawn;                                          // 0x00B3(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_6UK8[0x4];                                     // 0x00B4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UClass*>                              IgnoreIfTargetHasAnyState;                                 // 0x00B8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                               bIgnoreIfTargetGuard;                                      // 0x00C8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIgnoreIfTargetJustGuard;                                  // 0x00C9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bIgnoreIfTargetParry;                                      // 0x00CA(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Zenith_EAbilityTargetTypes                         TargetType;                                                // 0x00CB(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	Zenith_EFaction                                    FactionFilter;                                             // 0x00CC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_P752[0x3];                                     // 0x00CD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              ApplicationProbability;                                    // 0x00D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_ZD34[0x2C];                                    // 0x00D4(0x002C) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AbilityEffectComponent");
		return ptr;
	}



	void OnFinalizeEffect(class AActor* From, class AActor* To, const struct FHitInfos& HitInfos);
	void OnApplyEffect(class AActor* From, class AActor* To, const struct FHitInfos& HitInfos);
	void OnAbilityLaunched();
	bool IsEffectActive();
	bool IsComplete(float TotalExecutionTime, float* out_OverTime);
};

// Class Zenith.AbilityEffectDamageComponent
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAbilityEffectDamageComponent : public UAbilityEffectComponent
{
public:
	Zenith_EDamageAttribute                            DamageAttribute;                                           // 0x0100(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_2TA2[0x7];                                     // 0x0101(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AbilityEffectDamageComponent");
		return ptr;
	}



};

// Class Zenith.AbilityEffectTimedComponent
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAbilityEffectTimedComponent : public UAbilityEffectComponent
{
public:
	float                                              AbilityEffectDuration;                                     // 0x0100(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_NS2V[0x4];                                     // 0x0104(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AbilityEffectTimedComponent");
		return ptr;
	}



	float GetAbilityEffectDuration();
};

// Class Zenith.AbilityHitbox
// 0x00B8 (FullSize[0x0380] - InheritedSize[0x02C8])
class AAbilityHitbox : public AAbility
{
public:
	bool                                               bCanHitHitboxes;                                           // 0x02C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bCanBeHitByHitboxes;                                       // 0x02C9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_R2OP[0x6];                                     // 0x02CA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class AActor*>                              HadContactActors;                                          // 0x02D0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                              InContactActors;                                           // 0x02E0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                               bCollideInvoker;                                           // 0x02F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bCollideInvokerFaction;                                    // 0x02F1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bStopOnPawnCollision;                                      // 0x02F2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bStopOnHitboxCollision;                                    // 0x02F3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bStopOnNonPawnCollision;                                   // 0x02F4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_RZF2[0x3];                                     // 0x02F5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<TEnumAsByte<Engine_ECollisionChannel>>      BlockingCollisionChannels;                                 // 0x02F8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                               bIgnoreReentry;                                            // 0x0308(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_NP2G[0x3];                                     // 0x0309(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              RetriggerContactAfter;                                     // 0x030C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UClass*>                              SkipCollisionIfTargetHasAnyStates;                         // 0x0310(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class AActor*, struct FHitInfos>              HitInfosForActors;                                         // 0x0320(0x0050) (Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_R3GY[0x8];                                     // 0x0370(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USceneComponent*                             RootSceneComponent;                                        // 0x0378(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AbilityHitbox");
		return ptr;
	}



	void SetCollisionEnabled(bool bEnableCollision);
	void ProcessActorExit(class AActor* ExitActor);
	void ProcessActorEnter(class AActor* EnterActor, const struct FHitInfos& HitInfos);
	void OnPawnExit(class AActor* ExitActor);
	void OnPawnEnter(class AActor* EnterActor);
	void OnNonPawnEnter();
	void OnActorOverlapEnd(class UPrimitiveComponent* OverlapComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnActorOverlapBegin(class UPrimitiveComponent* OverlapComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
};

// Class Zenith.ZenithBaseSubsystem
// 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
class UZenithBaseSubsystem : public UGameInstanceSubsystem
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.ZenithBaseSubsystem");
		return ptr;
	}



};

// Class Zenith.AchievementsSubsystem
// 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
class UAchievementsSubsystem : public UZenithBaseSubsystem
{
public:
	unsigned char                                      UnknownData_OV8Y[0x50];                                    // 0x0030(0x0050) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AchievementsSubsystem");
		return ptr;
	}



	void UnlockAchievement(Zenith_EZenithAchievement Achievement);
	bool ResetAchievements();
	void OnMainProfileChanged();
	void OnGameDataLoaded();
	void NotifyActionPileLv3();
	void NotifyActionDashLv3();
	bool IsAchievementUnlocked(Zenith_EZenithAchievement Achievement);
	float GetAchievementProgress(Zenith_EZenithAchievement Achievement);
	struct FName GetAchievementID(Zenith_EZenithAchievement Achievement);
	class UDataTable* GetAchievementDataTable();
	bool GetAchievementData(Zenith_EZenithAchievement Achievement, struct FAchievementData* out_AchievementData);
};

// Class Zenith.ActorBPFLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UActorBPFLibrary : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.ActorBPFLibrary");
		return ptr;
	}



	bool STATIC_SetActorLocationToGround(class AActor* Actor, float OffsetFromGround);
	bool STATIC_IsPlayer(class AActor* Actor);
	class USceneComponent* STATIC_GetHomingTargetOfActor(class AActor* Actor);
	class AActor* STATIC_GetDefaultActorFromClass(class UClass* Class);
	struct FVector STATIC_GetActorTopLocation(class AActor* Actor);
	struct FVector STATIC_GetActorLocationForFeetLocation(class AActor* Actor, const struct FVector& FeetLocation);
	float STATIC_GetActorHalfHeight(class AActor* Actor);
	struct FVector STATIC_GetActorFeetLocation(class AActor* Actor);
	void STATIC_FlushPressedKeys(class APlayerController* PlayerController);
	void STATIC_ClampActorToBoxYZ(class AActor* Actor, class UBoxComponent* Box, bool bSweep);
	class UActorComponent* STATIC_AddComponent(class AActor* Actor, class UClass* ComponentType);
};

// Class Zenith.AE_CameraShakeComponent
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAE_CameraShakeComponent : public UAbilityEffectComponent
{
public:
	class UClass*                                      Shake;                                                     // 0x0100(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_CameraShakeComponent");
		return ptr;
	}



};

// Class Zenith.AE_DamageAbsoluteComponent
// 0x0008 (FullSize[0x0110] - InheritedSize[0x0108])
class UAE_DamageAbsoluteComponent : public UAbilityEffectDamageComponent
{
public:
	int                                                Damage;                                                    // 0x0108(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_2WOG[0x4];                                     // 0x010C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_DamageAbsoluteComponent");
		return ptr;
	}



};

// Class Zenith.AE_DamageComponent
// 0x0010 (FullSize[0x0118] - InheritedSize[0x0108])
class UAE_DamageComponent : public UAbilityEffectDamageComponent
{
public:
	Zenith_EDamageEffectType                           DamageEffectType;                                          // 0x0108(0x0001) ELEMENT_SIZE_MISMATCH (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_1ENM[0x3];                                     // 0x0108(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	int                                                AbsoluteDamage;                                            // 0x010C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              TargetPercentageDamage;                                    // 0x0110(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_J3T4[0x4];                                     // 0x0114(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_DamageComponent");
		return ptr;
	}



};

// Class Zenith.AE_ForceFeedbackComponent
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAE_ForceFeedbackComponent : public UAbilityEffectComponent
{
public:
	class UForceFeedbackEffect*                        ForceFeedbackEffect;                                       // 0x0100(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_ForceFeedbackComponent");
		return ptr;
	}



};

// Class Zenith.AE_HealAbsoluteComponent
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAE_HealAbsoluteComponent : public UAbilityEffectComponent
{
public:
	int                                                Heal;                                                      // 0x0100(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_ETL5[0x4];                                     // 0x0104(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_HealAbsoluteComponent");
		return ptr;
	}



};

// Class Zenith.AE_HitStopComponent
// 0x0008 (FullSize[0x0110] - InheritedSize[0x0108])
class UAE_HitStopComponent : public UAbilityEffectTimedComponent
{
public:
	bool                                               ExecuteOnInvoker;                                          // 0x0108(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                               ExecuteOnTarget;                                           // 0x0109(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_090V[0x6];                                     // 0x010A(0x0006) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_HitStopComponent");
		return ptr;
	}



};

// Class Zenith.AE_KnockbackComponent
// 0x0060 (FullSize[0x0160] - InheritedSize[0x0100])
class UAE_KnockbackComponent : public UAbilityEffectComponent
{
public:
	bool                                               bBypassStaminaCheck;                                       // 0x0100(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_GVMI[0x7];                                     // 0x0101(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FKnockbackData                              KnockbackData;                                             // 0x0108(0x0058) (Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_KnockbackComponent");
		return ptr;
	}



	struct FKnockbackData GetKnockbackData();
};

// Class Zenith.AE_RestoreMPToInvokerComponent
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAE_RestoreMPToInvokerComponent : public UAbilityEffectComponent
{
public:
	int                                                MpToRestore;                                               // 0x0100(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_HQUL[0x4];                                     // 0x0104(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_RestoreMPToInvokerComponent");
		return ptr;
	}



};

// Class Zenith.AE_ShakeTargetComponent
// 0x0060 (FullSize[0x0160] - InheritedSize[0x0100])
class UAE_ShakeTargetComponent : public UAbilityEffectComponent
{
public:
	struct FShakeData                                  GroundShakeData;                                           // 0x0100(0x0030) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FShakeData                                  AirShakeData;                                              // 0x0130(0x0030) (Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_ShakeTargetComponent");
		return ptr;
	}



};

// Class Zenith.AE_StaminaDamageAbsolute
// 0x0110 (FullSize[0x0210] - InheritedSize[0x0100])
class UAE_StaminaDamageAbsolute : public UAbilityEffectComponent
{
public:
	Zenith_EStaminaDamageEffectType                    DamageEffectType;                                          // 0x0100(0x0001) ELEMENT_SIZE_MISMATCH (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_EH66[0x3];                                     // 0x0100(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	int                                                Damage;                                                    // 0x0104(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              TargetPercentDamage;                                       // 0x0108(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_9Y2E[0x104];                                   // 0x010C(0x0104) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_StaminaDamageAbsolute");
		return ptr;
	}



};

// Class Zenith.AE_StunDamageAbsolute
// 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
class UAE_StunDamageAbsolute : public UAbilityEffectComponent
{
public:
	int                                                Damage;                                                    // 0x0100(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_MGDS[0x4];                                     // 0x0104(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AE_StunDamageAbsolute");
		return ptr;
	}



};

// Class Zenith.AITask_CustomMoveTo
// 0x0000 (FullSize[0x0110] - InheritedSize[0x0110])
class UAITask_CustomMoveTo : public UAITask_MoveTo
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AITask_CustomMoveTo");
		return ptr;
	}



	class UAITask_MoveTo* STATIC_CustomAIMoveTo(class AAIController* Controller, const struct FVector& GoalLocation, class AActor* GoalActor, float AcceptanceRadius, TEnumAsByte<AIModule_EAIOptionFlag> StopOnOverlap, TEnumAsByte<AIModule_EAIOptionFlag> AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic, bool bUseContinuosGoalTracking);
};

// Class Zenith.AnimBPFLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UAnimBPFLibrary : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AnimBPFLibrary");
		return ptr;
	}



	void STATIC_GetAnimData(class AZenithCharacter* Character, bool* out_bRunning, float* out_XYVelocityRatio);
};

// Class Zenith.AutoClimbComponent
// 0x00A8 (FullSize[0x0158] - InheritedSize[0x00B0])
class UAutoClimbComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnAutoClimb;                                               // 0x00B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                              AllowedMaxZVelocity;                                       // 0x00C0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxAngleForClimb;                                          // 0x00C4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                                   BoxExtentsXY;                                              // 0x00C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              ForwardOffset;                                             // 0x00D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              TraceSphereRadius;                                         // 0x00D4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MinHeightForAutoClimbHigh;                                 // 0x00D8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxHeightForAutoClimbHigh;                                 // 0x00DC(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MinHeightForAutoClimbMiddle;                               // 0x00E0(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxHeightForAutoClimbMiddle;                               // 0x00E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MinHeightForAutoClimbLow;                                  // 0x00E8(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxHeightForAutoClimbLow;                                  // 0x00EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              DistanceAboveHeadToCheck;                                  // 0x00F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_5W9B[0x4];                                     // 0x00F4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UClass*>                              IgnoreAutoClimbStates;                                     // 0x00F8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_FVXZ[0x10];                                    // 0x0108(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UBoxComponent*                               BoxComponent;                                              // 0x0118(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AZenithCharacter*                            CharacterOwner;                                            // 0x0120(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_P4YD[0x30];                                    // 0x0128(0x0030) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AutoClimbComponent");
		return ptr;
	}



	void OnStartCommand(class UCommandAction* CommandAction);
	void OnComponentOverlapEnd(class UPrimitiveComponent* OverlapComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnComponentOverlapBegin(class UPrimitiveComponent* OverlapComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void IgnoreActorUntilNextCommand(class AActor* Actor);
	struct FVector GetLastTargetLocation();
	float GetForwardOffset();
};

// Class Zenith.AutoCollectComponent
// 0x0010 (FullSize[0x00C0] - InheritedSize[0x00B0])
class UAutoCollectComponent : public UActorComponent
{
public:
	float                                              Radius;                                                    // 0x00B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_G3RI[0x4];                                     // 0x00B4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USphereComponent*                            SphereComponent;                                           // 0x00B8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AutoCollectComponent");
		return ptr;
	}



	void OnComponentOverlapBegin(class UPrimitiveComponent* OverlapComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
};

// Class Zenith.AutoMoveComponent
// 0x0030 (FullSize[0x0120] - InheritedSize[0x00F0])
class UAutoMoveComponent : public UMovementComponent
{
public:
	unsigned char                                      UnknownData_I36D[0x8];                                     // 0x00F0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     InitialVelocity;                                           // 0x00F8(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                     Acceleration;                                              // 0x0104(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                              MaxSpeed;                                                  // 0x0110(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bRotationFollowsVelocity;                                  // 0x0114(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_G6X0[0x3];                                     // 0x0115(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              GravityFactor;                                             // 0x0118(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_0P5E[0x4];                                     // 0x011C(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AutoMoveComponent");
		return ptr;
	}



	void SetVelocity(const struct FVector& NewVelocity);
};

// Class Zenith.AutoRotateComponent
// 0x0010 (FullSize[0x00C0] - InheritedSize[0x00B0])
class UAutoRotateComponent : public UActorComponent
{
public:
	struct FRotator                                    RotationSpeed;                                             // 0x00B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_Q4AS[0x4];                                     // 0x00BC(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.AutoRotateComponent");
		return ptr;
	}



};

// Class Zenith.BaseInventory
// 0x00A8 (FullSize[0x00D0] - InheritedSize[0x0028])
class UBaseInventory : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnTryAddItem;                                              // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnItemAdded;                                               // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnItemRemoved;                                             // 0x0048(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int                                                ItemLimit;                                                 // 0x0058(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bAllowDuplicates;                                          // 0x005C(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_4XU5[0x3];                                     // 0x005D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FInventoryBaseItemData>              Items;                                                     // 0x0060(0x0010) (Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_AB76[0x10];                                    // 0x0070(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<class UClass*, class UGetItemTrigger*>        InstanceForTriggerClasses;                                 // 0x0080(0x0050) (Transient, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BaseInventory");
		return ptr;
	}



	void RemoveItemByRowName(const struct FName& ItemRowName);
	void RemoveItem(const struct FDataTableRowHandle& ItemData);
	bool IsFull();
	bool HasItemByRowName(const struct FName& ItemRowName);
	bool HasItem(const struct FDataTableRowHandle& ItemData);
	class UDataTable* GetValidDataTable();
	int GetItemLimit();
	bool GetItemHandleAtIndex(int Index, struct FDataTableRowHandle* out_ItemHandle);
	int GetItemCount();
	bool GetItemAtIndex(int Index, struct FInventoryBaseItemData* out_Item);
	TArray<struct FInventoryBaseItemData> GetAllItems();
	void Clear();
	bool AllowDuplicate();
	bool AddItem(const struct FDataTableRowHandle& ItemData);
};

// Class Zenith.BattleColorComponent
// 0x0030 (FullSize[0x00E0] - InheritedSize[0x00B0])
class UBattleColorComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData_O2W4[0x8];                                     // 0x00B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UCurveFloat*                                 LoopCurve;                                                 // 0x00B8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                                 FadeInCurve;                                               // 0x00C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                                 FadeOutCurve;                                              // 0x00C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FName                                       MaterialParameterName;                                     // 0x00D0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_DREY[0x8];                                     // 0x00D8(0x0008) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BattleColorComponent");
		return ptr;
	}



	void SetBattleColorEnabled(bool bEnable);
	void SetAlpha(float NewAlpha);
};

// Class Zenith.BitshiftBPFLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UBitshiftBPFLibrary : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BitshiftBPFLibrary");
		return ptr;
	}



	int STATIC_BitshiftRight(int Value, int bitshift);
	int STATIC_BitshiftLeft(int Value, int bitshift);
};

// Class Zenith.BlackboardBPFLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UBlackboardBPFLibrary : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BlackboardBPFLibrary");
		return ptr;
	}



	struct FVector STATIC_GetLocationFromBlackboardKey(class UBTNode* NodeOwner, const struct FBlackboardKeySelector& Key);
};

// Class Zenith.BossRushComponent
// 0x0028 (FullSize[0x00D8] - InheritedSize[0x00B0])
class UBossRushComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData_TOB1[0x28];                                    // 0x00B0(0x0028) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BossRushComponent");
		return ptr;
	}



	void UnbindEvents();
	int TryAddNewRecord(const struct FBossRushRecordData& NewRecordData);
	void StartBossRush();
	void ResetRecords();
	void OnStartBossRush();
	void OnPlayerRespawn();
	void OnMapSwitch();
	void OnEndBossRush();
	void OnClearBossRush();
	bool IsBossRushActive();
	struct FBossRushRecordData GetRecordData(int RecordIndex);
	float GetBossRushTime();
	void EndBossRush();
	void ClearBossRush();
	bool CanUpdateTime();
	void BindEvents();
};

// Class Zenith.Box2DBPFLibrary
// 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
class UBox2DBPFLibrary : public UBlueprintFunctionLibrary
{
public:


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.Box2DBPFLibrary");
		return ptr;
	}



	bool STATIC_IsPointInside(const struct FBox2D& Box, const struct FVector2D& PointToCheck);
	bool STATIC_IsBoxInside(const struct FBox2D& Box, const struct FVector2D& BoxToCheck);
	struct FVector STATIC_GetClosestPointOnSurfaceYZ(class UBoxComponent* Box, const struct FVector& Point, Zenith_EBoxSide* BoxSide);
	struct FVector2D STATIC_GetClosestPointOnSurface(const struct FBox2D& Box, const struct FVector2D& Point, Zenith_EBoxSide* BoxSide);
	struct FVector2D STATIC_ClampPointInside(const struct FBox2D& Box, const struct FVector2D& Point);
};

// Class Zenith.Breakable
// 0x0020 (FullSize[0x0240] - InheritedSize[0x0220])
class ABreakable : public AActor
{
public:
	class USceneComponent*                             SceneRootComponent;                                        // 0x0220(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHPComponent*                                HPComponent;                                               // 0x0228(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClearableComponent*                         ClearableComponent;                                        // 0x0230(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                               bMarkClearedOnDeath;                                       // 0x0238(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_IHMY[0x7];                                     // 0x0239(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.Breakable");
		return ptr;
	}



	void OnDeath(class AActor* From);
	void OnBreak();
};

// Class Zenith.BTDecorator_HasState
// 0x0030 (FullSize[0x0098] - InheritedSize[0x0068])
class UBTDecorator_HasState : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                      TargetActor;                                               // 0x0068(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UClass*                                      State;                                                     // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BTDecorator_HasState");
		return ptr;
	}



};

// Class Zenith.BTDecorator_SetStates
// 0x0010 (FullSize[0x0078] - InheritedSize[0x0068])
class UBTDecorator_SetStates : public UBTDecorator
{
public:
	TArray<class UClass*>                              States;                                                    // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BTDecorator_SetStates");
		return ptr;
	}



};

// Class Zenith.BTDecorator_TimeLimitRandom
// 0x0008 (FullSize[0x0078] - InheritedSize[0x0070])
class UBTDecorator_TimeLimitRandom : public UBTDecorator_TimeLimit
{
public:
	float                                              TimeLimitMin;                                              // 0x0070(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9OM9[0x4];                                     // 0x0074(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BTDecorator_TimeLimitRandom");
		return ptr;
	}



};

// Class Zenith.BTDecorator_UnsetStates
// 0x0018 (FullSize[0x0080] - InheritedSize[0x0068])
class UBTDecorator_UnsetStates : public UBTDecorator
{
public:
	TArray<class UClass*>                              States;                                                    // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                               bCheckIfPresentBeforeUnset;                                // 0x0078(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JBD9[0x7];                                     // 0x0079(0x0007) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.BTDecorator_UnsetStates");
		return ptr;
	}



};

// Class Zenith.CameraClampVolume
// 0x0058 (FullSize[0x0278] - InheritedSize[0x0220])
class ACameraClampVolume : public AActor
{
public:
	bool                                               bActive;                                                   // 0x0220(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EFLV[0x7];                                     // 0x0221(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USceneComponent*                             SceneRootComponent;                                        // 0x0228(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                               ActivationBoxComponent;                                    // 0x0230(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                               ClampComponent;                                            // 0x0238(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                               Blocker_Up;                                                // 0x0240(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                               Blocker_Down;                                              // 0x0248(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                               Blocker_Left;                                              // 0x0250(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                               Blocker_Right;                                             // 0x0258(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int                                                Priority;                                                  // 0x0260(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_1BUC[0x14];                                    // 0x0264(0x0014) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.CameraClampVolume");
		return ptr;
	}



	void OnComponentOverlapEnd(class UPrimitiveComponent* OverlapComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnComponentOverlapBegin(class UPrimitiveComponent* OverlapComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	int GetPriority();
	struct FVector GetMinBorder();
	struct FVector GetMaxBorder();
};

// Class Zenith.ChallengeSettings
// 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
class UChallengeSettings : public UObject
{
public:
	struct FScriptMulticastDelegate                    OnPlayerCantHealChanged;                                   // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnMaxPlayerLevelChanged;                                   // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5RK4[0x18];                                    // 0x0048(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FChallengeSettingsData                      ChallengeSettingsData;                                     // 0x0060(0x0018) (Edit, EditConst, NoDestructor, NativeAccessSpecifierPrivate)


	static UClass* StaticClass()
	{
		static UClass* ptr = UObject::FindClass("Class Zenith.ChallengeSettings");
		return ptr;
	}



	bool SetPlayerOneShot(bool bNewPlayerOneShot);
	bool SetPlayerCantHeal(bool bPlayerCantHeal);
