#pragma once

// Name: enderlilies, Version: 1.1.3


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum Zenith.EAutoClimbType
enum class Zenith_EAutoClimbType : uint8_t
{
	EAutoClimbType__None           = 0,
	EAutoClimbType__Low            = 1,
	EAutoClimbType__Middle         = 2,
	EAutoClimbType__High           = 3,
	EAutoClimbType__EAutoClimbType_MAX = 4,

};

// Enum Zenith.ECommandRemoveTypes
enum class Zenith_ECommandRemoveTypes : uint8_t
{
	ECommandRemoveTypes__Normal    = 0,
	ECommandRemoveTypes__TTL       = 1,
	ECommandRemoveTypes__Override  = 2,
	ECommandRemoveTypes__Clear     = 3,
	ECommandRemoveTypes__NotStartable = 4,
	ECommandRemoveTypes__Group     = 5,
	ECommandRemoveTypes__Frame     = 6,
	ECommandRemoveTypes__ECommandRemoveTypes_MAX = 7,

};

// Enum Zenith.ECurrencyType
enum class Zenith_ECurrencyType : uint8_t
{
	ECurrencyType__Spirit_Lv1      = 0,
	ECurrencyType__Spirit_Lv2      = 1,
	ECurrencyType__Spirit_Lv3      = 2,
	ECurrencyType__Spirit_MAX      = 3,

};

// Enum Zenith.EKnockbackEndType
enum class Zenith_EKnockbackEndType : uint8_t
{
	EKnockbackEndType__Default     = 0,
	EKnockbackEndType__RequestedStop = 1,
	EKnockbackEndType__RequestedCancel = 2,
	EKnockbackEndType__EKnockbackEndType_MAX = 3,

};

// Enum Zenith.EKnockbackTypes
enum class Zenith_EKnockbackTypes : uint8_t
{
	EKnockbackTypes__Normal        = 0,
	EKnockbackTypes__Launch        = 1,
	EKnockbackTypes__EKnockbackTypes_MAX = 2,

};

// Enum Zenith.ECommandInputTypes
enum class Zenith_ECommandInputTypes : uint8_t
{
	ECommandInputTypes__NONE       = 0,
	ECommandInputTypes__JUMP       = 1,
	ECommandInputTypes__DODGE      = 2,
	ECommandInputTypes__ATTACK     = 3,
	ECommandInputTypes__SUMMON     = 4,
	ECommandInputTypes__SUMMON01   = 5,
	ECommandInputTypes__SUMMON_SET_SWITCH = 6,
	ECommandInputTypes__HOOK       = 7,
	ECommandInputTypes__HEAL       = 8,
	ECommandInputTypes__INTERACT   = 9,
	ECommandInputTypes__MAINMENU   = 10,
	ECommandInputTypes__PAUSE      = 11,
	ECommandInputTypes__MINIMAP    = 12,
	ECommandInputTypes__ANY        = 13,
	ECommandInputTypes__ECommandInputTypes_MAX = 14,

};

// Enum Zenith.EItemType
enum class Zenith_EItemType : uint8_t
{
	EItemType__None                = 0,
	EItemType__Dummy               = 1,
	EItemType__Parameter           = 2,
	EItemType__Aptitude            = 3,
	EItemType__Spirit              = 4,
	EItemType__Passive             = 5,
	EItemType__Tip                 = 6,
	EItemType__EItemType_MAX       = 7,

};

// Enum Zenith.EUIInputTypes
enum class Zenith_EUIInputTypes : uint8_t
{
	EUIInputTypes__NONE            = 0,
	EUIInputTypes__VALIDATION      = 1,
	EUIInputTypes__CANCEL          = 2,
	EUIInputTypes__CONTEXT         = 3,
	EUIInputTypes__RIGHT           = 4,
	EUIInputTypes__LEFT            = 5,
	EUIInputTypes__UP              = 6,
	EUIInputTypes__DOWN            = 7,
	EUIInputTypes__NEXT            = 8,
	EUIInputTypes__PREVIOUS        = 9,
	EUIInputTypes__DEBUG           = 10,
	EUIInputTypes__EUIInputTypes_MAX = 11,

};

// Enum Zenith.EDirectionInputTypes
enum class Zenith_EDirectionInputTypes : uint8_t
{
	EDirectionInputTypes__NONE     = 0,
	EDirectionInputTypes__UP       = 1,
	EDirectionInputTypes__DOWN     = 2,
	EDirectionInputTypes__LEFT     = 3,
	EDirectionInputTypes__RIGHT    = 4,
	EDirectionInputTypes__UP_RIGHT = 5,
	EDirectionInputTypes__UP_LEFT  = 6,
	EDirectionInputTypes__DOWN_RIGHT = 7,
	EDirectionInputTypes__DOWN_LEFT = 8,
	EDirectionInputTypes__MAX      = 9,

};

// Enum Zenith.ERichTextFormatType
enum class Zenith_ERichTextFormatType : uint8_t
{
	ERichTextFormatType__DIRECTION = 0,
	ERichTextFormatType__COMMAND   = 1,
	ERichTextFormatType__UI        = 2,
	ERichTextFormatType__CUSTOM    = 3,
	ERichTextFormatType__ERichTextFormatType_MAX = 4,

};

// Enum Zenith.EItemSpiritType
enum class Zenith_EItemSpiritType : uint8_t
{
	EItemSpiritType__Main          = 0,
	EItemSpiritType__Sub           = 1,
	EItemSpiritType__EItemSpiritType_MAX = 2,

};

// Enum Zenith.ESummonSet
enum class Zenith_ESummonSet : uint8_t
{
	ESummonSet__None               = 0,
	ESummonSet__SetA               = 1,
	ESummonSet__SetB               = 2,
	ESummonSet__ESummonSet_MAX     = 3,

};

// Enum Zenith.ESaveExistsType
enum class Zenith_ESaveExistsType : uint8_t
{
	ESaveExistsType__OK            = 0,
	ESaveExistsType__DoesNotExist  = 1,
	ESaveExistsType__Corrupt       = 2,
	ESaveExistsType__UnspecifiedError = 3,
	ESaveExistsType__ESaveExistsType_MAX = 4,

};

// Enum Zenith.EAbilityEffectQueue
enum class Zenith_EAbilityEffectQueue : uint8_t
{
	EAbilityEffectQueue__FIRST     = 0,
	EAbilityEffectQueue__PRE_DEFAULT = 1,
	EAbilityEffectQueue__DEFAULT   = 2,
	EAbilityEffectQueue__POST_DEFAULT = 3,
	EAbilityEffectQueue__MAX       = 4,

};

// Enum Zenith.EAbilityTargetTypes
enum class Zenith_EAbilityTargetTypes : uint8_t
{
	EAbilityTargetTypes__NONE      = 0,
	EAbilityTargetTypes__OPPONENTS = 1,
	EAbilityTargetTypes__ALLIES    = 2,
	EAbilityTargetTypes__ALL       = 3,
	EAbilityTargetTypes__EAbilityTargetTypes_MAX = 4,

};

// Enum Zenith.EAbilityStopReason
enum class Zenith_EAbilityStopReason : uint8_t
{
	EAbilityStopReason__NORMAL     = 0,
	EAbilityStopReason__MAX_EXECUTION_TIME = 1,
	EAbilityStopReason__CANCEL     = 2,
	EAbilityStopReason__END_PLAY   = 3,
	EAbilityStopReason__EAbilityStopReason_MAX = 4,

};

// Enum Zenith.EDamageAttribute
enum class Zenith_EDamageAttribute : uint8_t
{
	EDamageAttribute__Default      = 0,
	EDamageAttribute__Environment  = 1,
	EDamageAttribute__EDamageAttribute_MAX = 2,

};

// Enum Zenith.EAbilityType
enum class Zenith_EAbilityType : uint8_t
{
	EAbilityType__DEFAULT          = 0,
	EAbilityType__PILE_ATTACK      = 1,
	EAbilityType__DASH_ATTACK      = 2,
	EAbilityType__EAbilityType_MAX = 3,

};

// Enum Zenith.EZenithAchievement
enum class Zenith_EZenithAchievement : uint8_t
{
	EZenithAchievement__Invalid    = 0,
	EZenithAchievement__SpiritGet_S5010 = 1,
	EZenithAchievement__SpiritGet_S5020 = 2,
	EZenithAchievement__SpiritGet_S5030 = 3,
	EZenithAchievement__SpiritGet_S5040 = 4,
	EZenithAchievement__SpiritGet_S5050 = 5,
	EZenithAchievement__SpiritGet_S5060 = 6,
	EZenithAchievement__SpiritGet_S5070 = 7,
	EZenithAchievement__SpiritGet_S5080 = 8,
	EZenithAchievement__SpiritGet_AllBosses = 9,
	EZenithAchievement__SpiritGet_Count = 10,
	EZenithAchievement__SpiritGet_Count01 = 11,
	EZenithAchievement__SpiritGet_Count02 = 12,
	EZenithAchievement__SpiritGet_Count_ALL = 13,
	EZenithAchievement__SpiritLevel_Max_Count = 14,
	EZenithAchievement__SpiritLevel_Max_Count01 = 15,
	EZenithAchievement__SpiritLevel_Max_S5000 = 16,
	EZenithAchievement__PassiveGet_Count = 17,
	EZenithAchievement__PassiveGet_Count01 = 18,
	EZenithAchievement__PassiveGet_Count_ALL = 19,
	EZenithAchievement__ItemGet_HpMax_ALL = 20,
	EZenithAchievement__ItemGet_HealPower_ALL = 21,
	EZenithAchievement__ItemGet_PassiveSlot_ALL = 22,
	EZenithAchievement__TipsGet_024To028 = 23,
	EZenithAchievement__TipsGet_045 = 24,
	EZenithAchievement__TipsGet_ALL = 25,
	EZenithAchievement__PlayerLevel = 26,
	EZenithAchievement__PlayerLevel01 = 27,
	EZenithAchievement__PlayerLevel02 = 28,
	EZenithAchievement__RestPoint_Count = 29,
	EZenithAchievement__RestPoint_Count_ALL = 30,
	EZenithAchievement__Maps_Open_ALL = 31,
	EZenithAchievement__Strengthen_First_Use = 32,
	EZenithAchievement__Ending_A   = 33,
	EZenithAchievement__Ending_B   = 34,
	EZenithAchievement__Ending_C   = 35,
	EZenithAchievement__Action_Dash_Lv3 = 36,
	EZenithAchievement__Action_Pile_Lv3 = 37,
	EZenithAchievement__Passive_Get_Final = 38,
	EZenithAchievement__EZenithAchievement_MAX = 39,

};

// Enum Zenith.EDamageEffectType
enum class Zenith_EDamageEffectType : uint8_t
{
	EDamageEffectType__AttackParameter = 0,
	EDamageEffectType__Absolute    = 1,
	EDamageEffectType__TargetPercentage = 2,
	EDamageEffectType__EDamageEffectType_MAX = 3,

};

// Enum Zenith.EStaminaDamageEffectType
enum class Zenith_EStaminaDamageEffectType : uint8_t
{
	EStaminaDamageEffectType__Absolute = 0,
	EStaminaDamageEffectType__TargetPercentage = 1,
	EStaminaDamageEffectType__ForceBreak = 2,
	EStaminaDamageEffectType__EStaminaDamageEffectType_MAX = 3,

};

// Enum Zenith.EAIIdleType
enum class Zenith_EAIIdleType : uint8_t
{
	EAIIdleType__None              = 0,
	EAIIdleType__Patrol            = 1,
	EAIIdleType__IdlePeace         = 2,
	EAIIdleType__EAIIdleType_MAX   = 3,

};

// Enum Zenith.EAptitudeType
enum class Zenith_EAptitudeType : uint8_t
{
	EAptitudeType__None            = 0,
	EAptitudeType__Jump            = 1,
	EAptitudeType__DoubleJump      = 2,
	EAptitudeType__Dodge           = 3,
	EAptitudeType__Dash            = 4,
	EAptitudeType__DashAttack      = 5,
	EAptitudeType__PoundAttack     = 6,
	EAptitudeType__Swim            = 7,
	EAptitudeType__Dive            = 8,
	EAptitudeType__Wallgrab        = 9,
	EAptitudeType__Hook            = 10,
	EAptitudeType__DoorUnlock      = 11,
	EAptitudeType__SpecialAttack   = 12,
	EAptitudeType__Stumble         = 13,
	EAptitudeType__EAptitudeType_MAX = 14,

};

// Enum Zenith.EBoxSide
enum class Zenith_EBoxSide : uint8_t
{
	EBoxSide__None                 = 0,
	EBoxSide__Top                  = 1,
	EBoxSide__Bottom               = 2,
	EBoxSide__Left                 = 3,
	EBoxSide__Right                = 4,
	EBoxSide__EBoxSide_MAX         = 5,

};

// Enum Zenith.ECommandSummonLimitType
enum class Zenith_ECommandSummonLimitType : uint8_t
{
	ECommandSummonLimitType__None  = 0,
	ECommandSummonLimitType__CastCount = 1,
	ECommandSummonLimitType__Time  = 2,
	ECommandSummonLimitType__AttackCount = 3,
	ECommandSummonLimitType__ECommandSummonLimitType_MAX = 4,

};

// Enum Zenith.ECommandCondition
enum class Zenith_ECommandCondition : uint8_t
{
	ECommandCondition__NONE        = 0,
	ECommandCondition__IsGrounded  = 1,
	ECommandCondition__IsAirborne  = 2,
	ECommandCondition__IsSwimming  = 3,
	ECommandCondition__IsAirborneOrSwimming = 4,
	ECommandCondition__IsPressingUp = 5,
	ECommandCondition__IsPressingDown = 6,
	ECommandCondition__IsPressingLeft = 7,
	ECommandCondition__IsPressingRight = 8,
	ECommandCondition__IsPressingUpStrict = 9,
	ECommandCondition__IsPressingHorizontal = 10,
	ECommandCondition__IsPressingVertical = 11,
	ECommandCondition__HasTarget   = 12,
	ECommandCondition__HasNoTarget = 13,
	ECommandCondition__IsTargetGrounded = 14,
	ECommandCondition__IsTargetAirborne = 15,
	ECommandCondition__ECommandCondition_MAX = 16,

};

// Enum Zenith.ECommandResult
enum class Zenith_ECommandResult : uint8_t
{
	ECommandResult__NONE           = 0,
	ECommandResult__IN_PROGRESS    = 1,
	ECommandResult__SUCCESS        = 2,
	ECommandResult__FAILURE        = 3,
	ECommandResult__ECommandResult_MAX = 4,

};

// Enum Zenith.EConditionType
enum class Zenith_EConditionType : uint8_t
{
	EConditionType__Superior       = 0,
	EConditionType__SuperiorOrEqual = 1,
	EConditionType__Equal          = 2,
	EConditionType__InferiorOrEqual = 3,
	EConditionType__Inferior       = 4,
	EConditionType__EConditionType_MAX = 5,

};

// Enum Zenith.EConversationFlowMode
enum class Zenith_EConversationFlowMode : uint8_t
{
	EConversationFlowMode__Manual  = 0,
	EConversationFlowMode__Auto    = 1,
	EConversationFlowMode__EConversationFlowMode_MAX = 2,

};

// Enum Zenith.EDeathStyle
enum class Zenith_EDeathStyle : uint8_t
{
	EDeathStyle__ANIMATION         = 0,
	EDeathStyle__KNOCKBACK         = 1,
	EDeathStyle__PLAYER            = 2,
	EDeathStyle__MANUAL            = 3,
	EDeathStyle__DISSOLVE          = 4,
	EDeathStyle__EDeathStyle_MAX   = 5,

};

// Enum Zenith.EEnemySpawnPointClearTiming
enum class Zenith_EEnemySpawnPointClearTiming : uint8_t
{
	EEnemySpawnPointClearTiming__None = 0,
	EEnemySpawnPointClearTiming__OnDeath = 1,
	EEnemySpawnPointClearTiming__OnPostDeath = 2,
	EEnemySpawnPointClearTiming__EEnemySpawnPointClearTiming_MAX = 3,

};

// Enum Zenith.EZenithError
enum class Zenith_EZenithError : uint8_t
{
	EZenithError__None             = 0,
	EZenithError__SaveFailed       = 1,
	EZenithError__LoadFailed       = 2,
	EZenithError__LoadInvalidSaveDataVersion = 3,
	EZenithError__EZenithError_MAX = 4,

};

// Enum Zenith.EFaction
enum class Zenith_EFaction : uint8_t
{
	EFaction__None                 = 0,
	EFaction__Players              = 1,
	EFaction__Enemies              = 2,
	EFaction__PlayerCompanions     = 3,
	EFaction__EFaction_MAX         = 4,

};

// Enum Zenith.EFadeTypes
enum class Zenith_EFadeTypes : uint8_t
{
	EFadeTypes__None               = 0,
	EFadeTypes__FadeIn             = 1,
	EFadeTypes__FadeOut            = 2,
	EFadeTypes__EFadeTypes_MAX     = 3,

};

// Enum Zenith.EFollowSplineType
enum class Zenith_EFollowSplineType : uint8_t
{
	EFollowSplineType__None        = 0,
	EFollowSplineType__Loop        = 1,
	EFollowSplineType__PingPong    = 2,
	EFollowSplineType__EFollowSplineType_MAX = 3,

};

// Enum Zenith.ELaunchGameIntent
enum class Zenith_ELaunchGameIntent : uint8_t
{
	ELaunchGameIntent__Unknown     = 0,
	ELaunchGameIntent__NewGame     = 1,
	ELaunchGameIntent__Continue    = 2,
	ELaunchGameIntent__NewGamePlus = 3,
	ELaunchGameIntent__ELaunchGameIntent_MAX = 4,

};

// Enum Zenith.EGameEndingType
enum class Zenith_EGameEndingType : uint8_t
{
	EGameEndingType__EndingA       = 0,
	EGameEndingType__EndingB       = 1,
	EGameEndingType__EndingC       = 2,
	EGameEndingType__EGameEndingType_MAX = 3,

};

// Enum Zenith.ERichTextDecoratorMode
enum class Zenith_ERichTextDecoratorMode : uint8_t
{
	ERichTextDecoratorMode__Auto   = 0,
	ERichTextDecoratorMode__ForceKeyboard = 1,
	ERichTextDecoratorMode__ForceGamepad = 2,
	ERichTextDecoratorMode__ERichTextDecoratorMode_MAX = 3,

};

// Enum Zenith.EBindingType
enum class Zenith_EBindingType : uint8_t
{
	EBindingType__All              = 0,
	EBindingType__Gamepad          = 1,
	EBindingType__Keyboard         = 2,
	EBindingType__EBindingType_MAX = 3,

};

// Enum Zenith.EInputActionSet
enum class Zenith_EInputActionSet : uint8_t
{
	EInputActionSet__Game          = 0,
	EInputActionSet__Menu          = 1,
	EInputActionSet__Event         = 2,
	EInputActionSet__EInputActionSet_MAX = 3,

};

// Enum Zenith.EInputStyle
enum class Zenith_EInputStyle : uint8_t
{
	EInputStyle__INPUTSTYLE_NONE   = 0,
	EInputStyle__INPUTSTYLE_KEYBOARD = 1,
	EInputStyle__INPUTSTYLE_XBOX360 = 2,
	EInputStyle__INPUTSTYLE_XBOXONE = 3,
	EInputStyle__INPUTSTYLE_PS4    = 4,
	EInputStyle__INPUTSTYLE_PS5    = 5,
	EInputStyle__INPUTSTYLE_SWITCH = 6,
	EInputStyle__INPUTSTYLE_PC_PS4 = 7,
	EInputStyle__INPUTSTYLE_PC_PS5 = 8,
	EInputStyle__INPUTSTYLE_PC_SWITCH = 9,
	EInputStyle__INPUTSTYLE_MAX    = 10,

};

// Enum Zenith.EInteractableFacingMode
enum class Zenith_EInteractableFacingMode : uint8_t
{
	EInteractableFacingMode__NONE  = 0,
	EInteractableFacingMode__RIGHT = 1,
	EInteractableFacingMode__LEFT  = 2,
	EInteractableFacingMode__EInteractableFacingMode_MAX = 3,

};

// Enum Zenith.EInteractableInputType
enum class Zenith_EInteractableInputType : uint8_t
{
	EInteractableInputType__NONE   = 0,
	EInteractableInputType__UP     = 1,
	EInteractableInputType__DOWN   = 2,
	EInteractableInputType__EInteractableInputType_MAX = 3,

};

// Enum Zenith.ELightEmulatorMode
enum class Zenith_ELightEmulatorMode : uint8_t
{
	ELightEmulatorMode__LightSimulation = 0,
	ELightEmulatorMode__CustomValues = 1,
	ELightEmulatorMode__ELightEmulatorMode_MAX = 2,

};

// Enum Zenith.ECustomMovementMode
enum class Zenith_ECustomMovementMode : uint8_t
{
	ECustomMovementMode__None      = 0,
	ECustomMovementMode__Swimming  = 1,
	ECustomMovementMode__ECustomMovementMode_MAX = 2,

};

// Enum Zenith.EWalkMode
enum class Zenith_EWalkMode : uint8_t
{
	EWalkMode__None                = 0,
	EWalkMode__Walk                = 1,
	EWalkMode__Run                 = 2,
	EWalkMode__Dash                = 3,
	EWalkMode__EWalkMode_MAX       = 4,

};

// Enum Zenith.EPassiveEquipResult
enum class Zenith_EPassiveEquipResult : uint8_t
{
	EPassiveEquipResult__Success   = 0,
	EPassiveEquipResult__InsufficientFreeSlotCount = 1,
	EPassiveEquipResult__PassiveEquipLimitReached = 2,
	EPassiveEquipResult__InvalidPassive = 3,
	EPassiveEquipResult__EPassiveEquipResult_MAX = 4,

};

// Enum Zenith.EPawnVolumeState
enum class Zenith_EPawnVolumeState : uint8_t
{
	EPawnVolumeState__NONE         = 0,
	EPawnVolumeState__ACTIVATED    = 1,
	EPawnVolumeState__CLEARED      = 2,
	EPawnVolumeState__EPawnVolumeState_MAX = 3,

};

// Enum Zenith.ERecollectionItemType
enum class Zenith_ERecollectionItemType : uint8_t
{
	ERecollectionItemType__Boss    = 0,
	ERecollectionItemType__Movie   = 1,
	ERecollectionItemType__ERecollectionItemType_MAX = 2,

};

// Enum Zenith.ETranslucencyLayer
enum class Zenith_ETranslucencyLayer : uint8_t
{
	ETranslucencyLayer__Default    = 0,
	ETranslucencyLayer__Boss       = 1,
	ETranslucencyLayer__Companion  = 2,
	ETranslucencyLayer__EnemyBack  = 3,
	ETranslucencyLayer__SpiritDefault = 4,
	ETranslucencyLayer__EnemyDefault = 5,
	ETranslucencyLayer__AboveEnemyBelowPlayer = 6,
	ETranslucencyLayer__Player     = 7,
	ETranslucencyLayer__AbovePlayerBelowSpiritFront = 8,
	ETranslucencyLayer__SpiritFront = 9,
	ETranslucencyLayer__AbovePlayer = 10,
	ETranslucencyLayer__ETranslucencyLayer_MAX = 11,

};

// Enum Zenith.ESoundHeavinessCategory
enum class Zenith_ESoundHeavinessCategory : uint8_t
{
	ESoundHeavinessCategory__NONE  = 0,
	ESoundHeavinessCategory__Light = 1,
	ESoundHeavinessCategory__Medium = 2,
	ESoundHeavinessCategory__Heavy = 3,
	ESoundHeavinessCategory__ESoundHeavinessCategory_MAX = 4,

};

// Enum Zenith.ESoundAction
enum class Zenith_ESoundAction : uint8_t
{
	ESoundAction__NONE             = 0,
	ESoundAction__Cut              = 1,
	ESoundAction__Knock            = 2,
	ESoundAction__Stab             = 3,
	ESoundAction__ESoundAction_MAX = 4,

};

// Enum Zenith.ESoundMaterial
enum class Zenith_ESoundMaterial : uint8_t
{
	ESoundMaterial__NONE           = 0,
	ESoundMaterial__Iron           = 1,
	ESoundMaterial__Meat           = 2,
	ESoundMaterial__Wood           = 3,
	ESoundMaterial__Stone          = 4,
	ESoundMaterial__ESoundMaterial_MAX = 5,

};

// Enum Zenith.ESoundFamily
enum class Zenith_ESoundFamily : uint8_t
{
	ESoundFamily__None             = 0,
	ESoundFamily__BGM              = 1,
	ESoundFamily__SE               = 2,
	ESoundFamily__Ambience         = 3,
	ESoundFamily__ESoundFamily_MAX = 4,

};

// Enum Zenith.EDamageAdditiveType
enum class Zenith_EDamageAdditiveType : uint8_t
{
	EDamageAdditiveType__Never     = 0,
	EDamageAdditiveType__Always    = 1,
	EDamageAdditiveType__GroundedOnly = 2,
	EDamageAdditiveType__EDamageAdditiveType_MAX = 3,

};

// Enum Zenith.EImpartRootMotionVelocityType
enum class Zenith_EImpartRootMotionVelocityType : uint8_t
{
	EImpartRootMotionVelocityType__Never = 0,
	EImpartRootMotionVelocityType__Always = 1,
	EImpartRootMotionVelocityType__OnAnimationComplete = 2,
	EImpartRootMotionVelocityType__EImpartRootMotionVelocityType_MAX = 3,

};

// Enum Zenith.ESpineRefreshType
enum class Zenith_ESpineRefreshType : uint8_t
{
	ESpineRefreshType__DoNotRefresh = 0,
	ESpineRefreshType__RefreshWithoutTransition = 1,
	ESpineRefreshType__RefreshWithTransition = 2,
	ESpineRefreshType__ESpineRefreshType_MAX = 3,

};

// Enum Zenith.ESpineKnockbackType
enum class Zenith_ESpineKnockbackType : uint8_t
{
	ESpineKnockbackType__NONE      = 0,
	ESpineKnockbackType__UP        = 1,
	ESpineKnockbackType__APEX      = 2,
	ESpineKnockbackType__DOWN_WEAK = 3,
	ESpineKnockbackType__DOWN_STRONG = 4,
	ESpineKnockbackType__ESpineKnockbackType_MAX = 5,

};

// Enum Zenith.ESpineLocomotionType
enum class Zenith_ESpineLocomotionType : uint8_t
{
	ESpineLocomotionType__NONE     = 0,
	ESpineLocomotionType__IDLE     = 1,
	ESpineLocomotionType__WALK     = 2,
	ESpineLocomotionType__RUN      = 3,
	ESpineLocomotionType__JUMP_UP  = 4,
	ESpineLocomotionType__JUMP_APEX = 5,
	ESpineLocomotionType__FALL     = 6,
	ESpineLocomotionType__FLY_IDLE = 7,
	ESpineLocomotionType__FLY_UP   = 8,
	ESpineLocomotionType__FLY_DOWN = 9,
	ESpineLocomotionType__FLY_WALK = 10,
	ESpineLocomotionType__FLY_RUN  = 11,
	ESpineLocomotionType__SWIM_IDLE = 12,
	ESpineLocomotionType__SWIM_UP  = 13,
	ESpineLocomotionType__SWIM_DOWN = 14,
	ESpineLocomotionType__SWIM_LATERAL = 15,
	ESpineLocomotionType__DIVE_IDLE = 16,
	ESpineLocomotionType__DIVE_UP  = 17,
	ESpineLocomotionType__DIVE_DOWN = 18,
	ESpineLocomotionType__DIVE_LATERAL = 19,
	ESpineLocomotionType__ESpineLocomotionType_MAX = 20,

};

// Enum Zenith.ESpineAnimationLayer
enum class Zenith_ESpineAnimationLayer : uint8_t
{
	ESpineAnimationLayer__NONE     = 0,
	ESpineAnimationLayer__LOCOMOTION = 1,
	ESpineAnimationLayer__LOCOMOTION_TRANSITION = 2,
	ESpineAnimationLayer__ACTION   = 3,
	ESpineAnimationLayer__KNOCKBACK_FALL = 4,
	ESpineAnimationLayer__REACTION = 5,
	ESpineAnimationLayer__DEATH    = 6,
	ESpineAnimationLayer__EVENT_LOCOMOTION = 7,
	ESpineAnimationLayer__EVENT_KEEP = 8,
	ESpineAnimationLayer__EVENT    = 9,
	ESpineAnimationLayer__ESpineAnimationLayer_MAX = 10,

};

// Enum Zenith.ESpineTrackLayer
enum class Zenith_ESpineTrackLayer : uint8_t
{
	ESpineTrackLayer__DEFAULT      = 0,
	ESpineTrackLayer__MEAT_ACTION  = 1,
	ESpineTrackLayer__DAMAGE_ADDITIVE = 2,
	ESpineTrackLayer__ESpineTrackLayer_MAX = 3,

};

// Enum Zenith.ESpiritUnequipReason
enum class Zenith_ESpiritUnequipReason : uint8_t
{
	ESpiritUnequipReason__Unequip  = 0,
	ESpiritUnequipReason__SummonSetSwitch = 1,
	ESpiritUnequipReason__ESpiritUnequipReason_MAX = 2,

};

// Enum Zenith.ESpiritEndType
enum class Zenith_ESpiritEndType : uint8_t
{
	ESpiritEndType__Manual         = 0,
	ESpiritEndType__CommandQueueEnd = 1,
	ESpiritEndType__Time           = 2,
	ESpiritEndType__ESpiritEndType_MAX = 3,

};

// Enum Zenith.EResummonType
enum class Zenith_EResummonType : uint8_t
{
	EResummonType__AlwaysSummon    = 0,
	EResummonType__UnsummonIfSummoned = 1,
	EResummonType__EResummonType_MAX = 2,

};

// Enum Zenith.ESpiritDirectionStyle
enum class Zenith_ESpiritDirectionStyle : uint8_t
{
	ESpiritDirectionStyle__FollowInput = 0,
	ESpiritDirectionStyle__NoChange = 1,
	ESpiritDirectionStyle__CopySummoner = 2,
	ESpiritDirectionStyle__DashBeforeAction = 3,
	ESpiritDirectionStyle__DashWhileAction = 4,
	ESpiritDirectionStyle__ESpiritDirectionStyle_MAX = 5,

};

// Enum Zenith.ESpiritLocationStyle
enum class Zenith_ESpiritLocationStyle : uint8_t
{
	ESpiritLocationStyle__Default  = 0,
	ESpiritLocationStyle__ResetToSummoner = 1,
	ESpiritLocationStyle__ESpiritLocationStyle_MAX = 2,

};

// Enum Zenith.StreamingVolumeState
enum class Zenith_EStreamingVolumeState : uint8_t
{
	StreamingVolumeState__None     = 0,
	StreamingVolumeState__LoadingPrimary = 1,
	StreamingVolumeState__LoadingSecondary = 2,
	StreamingVolumeState__FullyLoaded = 3,
	StreamingVolumeState__WaitBeforeUnload = 4,
	StreamingVolumeState__StreamingVolumeState_MAX = 5,

};

// Enum Zenith.ETutorialHook
enum class Zenith_ETutorialHook : uint8_t
{
	ETutorialHook__NONE            = 0,
	ETutorialHook__RestMenu        = 1,
	ETutorialHook__ETutorialHook_MAX = 2,

};

// Enum Zenith.EUMGZOrderLayer
enum class Zenith_EUMGZOrderLayer : uint8_t
{
	EUMGZOrderLayer__Default       = 0,
	EUMGZOrderLayer__AreaDiscovery = 1,
	EUMGZOrderLayer__Menu          = 2,
	EUMGZOrderLayer__Fade          = 3,
	EUMGZOrderLayer__MoviePlayer   = 4,
	EUMGZOrderLayer__PauseMenu     = 5,
	EUMGZOrderLayer__Dialogue      = 6,
	EUMGZOrderLayer__System        = 7,
	EUMGZOrderLayer__SystemController = 8,
	EUMGZOrderLayer__InputLock     = 9,
	EUMGZOrderLayer__EUMGZOrderLayer_MAX = 10,

};

// Enum Zenith.ECompanionMovementMode
enum class Zenith_ECompanionMovementMode : uint8_t
{
	ECompanionMovementMode__DEFAULT = 0,
	ECompanionMovementMode__DIRECT_TIMED = 1,
	ECompanionMovementMode__ECompanionMovementMode_MAX = 2,

};

// Enum Zenith.ECompanionState
enum class Zenith_ECompanionState : uint8_t
{
	ECompanionState__NONE          = 0,
	ECompanionState__MOVE          = 1,
	ECompanionState__IDLE          = 2,
	ECompanionState__SHOW_SPINE    = 3,
	ECompanionState__SPINE_VISIBLE = 4,
	ECompanionState__HIDE_SPINE    = 5,
	ECompanionState__ECompanionState_MAX = 6,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Zenith.ObjectArray
// 0x0010
struct FObjectArray
{
	TArray<class UObject*>                             Entries;                                                   // 0x0000(0x0010) (ZeroConstructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.AbilityParams
// 0x0008
struct FAbilityParams
{
	float                                              MaxExecutionTimeOverride;                                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageRate;                                                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.AbilityVisualCue
// 0x0018
struct FAbilityVisualCue
{
	bool                                               bUseVisualCue;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9LYU[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UParticleSystem*                             VisualCueFX;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LeadTime;                                                  // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XEAN[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Zenith.AbilityDescription
// 0x0060
struct FAbilityDescription
{
	class UClass*                                      AbilityClass;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAbilityParams                              AbilityParameters;                                         // 0x0008(0x0008) (Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                                  Offset;                                                    // 0x0010(0x0030) (Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	SpineExtensionPlugin_ESpineBone                    SpawnBone;                                                 // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0IBV[0x3];                                     // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       CustomSpawnBone;                                           // 0x0044(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFollowSpawnBoneRotation;                                  // 0x004C(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	SpineExtensionPlugin_ESpineBone                    AttachBone;                                                // 0x004D(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0SWD[0x2];                                     // 0x004E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       CustomAttachBone;                                          // 0x0050(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFollowAttachBoneRotation;                                 // 0x0058(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFireAndForget;                                            // 0x0059(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_T9WL[0x6];                                     // 0x005A(0x0006) MISSED OFFSET (PADDING)

};

// ScriptStruct Zenith.AbilityTimelineEntry
// 0x0090
struct FAbilityTimelineEntry
{
	struct FAbilityDescription                         AbilityDescription;                                        // 0x0000(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                              From;                                                      // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              To;                                                        // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAbilityVisualCue                           AbilityVisualCue;                                          // 0x0068(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	class AAbility*                                    Instance;                                                  // 0x0080(0x0008) (ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_Y43G[0x8];                                     // 0x0088(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Zenith.AbilityTimeline
// 0x0060
struct FAbilityTimeline
{
	class UAbilityComponent*                           TargetAbilityComponent;                                    // 0x0000(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpineFXComponent*                           FXComponent;                                               // 0x0008(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_YO4S[0x10];                                    // 0x0010(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  GlobalOffset;                                              // 0x0020(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAbilityTimelineEntry>               Entries;                                                   // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

};

// ScriptStruct Zenith.HitInfos
// 0x0120
struct FHitInfos
{
	int                                                ID;                                                        // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1RIO[0xC];                                     // 0x0004(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  OriginalFromTransform;                                     // 0x0010(0x0030) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                                  OriginalToTransform;                                       // 0x0040(0x0030) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     HitLocation;                                               // 0x0070(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0RJL[0x4];                                     // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UPrimitiveComponent*                         OtherComp;                                                 // 0x0080(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFromSweep;                                                // 0x0088(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_4Y71[0x3];                                     // 0x0089(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FHitResult                                  HitResult;                                                 // 0x008C(0x008C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                              TimeWhenHit;                                               // 0x0118(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bGuard;                                                    // 0x011C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bJustGuard;                                                // 0x011D(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bJustDodged;                                               // 0x011E(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bParried;                                                  // 0x011F(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.KnockbackData
// 0x0050 (0x0058 - 0x0008)
struct FKnockbackData : public FTableRowBase
{
	bool                                               bForceRestartDamageAnimation;                              // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bResetVelocity;                                            // 0x0009(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0Q6E[0x2];                                     // 0x000A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     LaunchVectorGrounded;                                      // 0x000C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     LaunchVectorAir;                                           // 0x0018(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     LaunchVectorSwim;                                          // 0x0024(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAbsoluteLaunchVector;                                     // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bKnockbackUntilGrounded;                                   // 0x0031(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_08A1[0x2];                                     // 0x0032(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              StunTime;                                                  // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MoveTime;                                                  // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Strength;                                                  // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                                 MovementCurve;                                             // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UClass*>                              AdditionalStates;                                          // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.InventoryBaseItemData
// 0x0008
struct FInventoryBaseItemData
{
	struct FName                                       RowName;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.StateTimelineEntry
// 0x0018
struct FStateTimelineEntry
{
	class UClass*                                      State;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              From;                                                      // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              To;                                                        // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0687[0x8];                                     // 0x0010(0x0008) MISSED OFFSET (PADDING)

};

// ScriptStruct Zenith.StateTimeline
// 0x0020
struct FStateTimeline
{
	unsigned char                                      UnknownData_APM6[0x10];                                    // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FStateTimelineEntry>                 StateEntries;                                              // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

};

// ScriptStruct Zenith.ShakeData
// 0x0030
struct FShakeData
{
	float                                              OscillationDuration;                                       // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              OscillationBlendInTime;                                    // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              OscillationBlendOutTime;                                   // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVOscillator                                LocOscillation;                                            // 0x000C(0x0024) (Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.ChallengeSettingsData
// 0x0018
struct FChallengeSettingsData
{
	bool                                               bChallengeSettingsUnlocked;                                // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bPlayerOneShotKill;                                        // 0x0001(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bPlayerCantHeal;                                           // 0x0002(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3PXL[0x1];                                     // 0x0003(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                MaxPlayerLevel;                                            // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                MaxSpiritLevel;                                            // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ContactDamageFactor;                                       // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EnemyAttackFactor;                                         // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EnemyMaxHPFactor;                                          // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.NameSet
// 0x0050
struct FNameSet
{
	unsigned char                                      Set[0x50];                                                 // 0x0000(0x0050) UNKNOWN PROPERTY: SetProperty

};

// ScriptStruct Zenith.NameTransformMap
// 0x0050
struct FNameTransformMap
{
	TMap<struct FName, struct FTransform>              Entries;                                                   // 0x0000(0x0050) (NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.SoundTimelineEntry
// 0x0010
struct FSoundTimelineEntry
{
	class UFMODEvent*                                  SoundEvent;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIs2DSound;                                                // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RTT2[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              From;                                                      // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.SoundTimeline
// 0x0020
struct FSoundTimeline
{
	unsigned char                                      UnknownData_98NU[0x10];                                    // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FSoundTimelineEntry>                 SoundEntries;                                              // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

};

// ScriptStruct Zenith.SpineAnimationDefinition
// 0x0048
struct FSpineAnimationDefinition
{
	struct FString                                     AnimationName;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bLoop;                                                     // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHold;                                                     // 0x0011(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseRootMotion;                                            // 0x0012(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LPSC[0x1];                                     // 0x0013(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              StartTime;                                                 // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EndTime;                                                   // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BlendIn;                                                   // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Zenith_EImpartRootMotionVelocityType               ImpartRootMotionVelocityType;                              // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<Engine_EMovementMode>                  MovementModeToSetOnStart;                                  // 0x0021(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<Engine_EMovementMode>                  MovementModeToSetOnEnd;                                    // 0x0022(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GXC7[0x1];                                     // 0x0023(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptDelegate                             OnAnimComplete;                                            // 0x0024(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptDelegate                             OnAnimEnd;                                                 // 0x0034(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_O0QO[0x4];                                     // 0x0044(0x0004) MISSED OFFSET (PADDING)

};

// ScriptStruct Zenith.NextComboAction
// 0x0018
struct FNextComboAction
{
	TArray<Zenith_ECommandCondition>                   Conditions;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UClass*                                      CommandActionClass;                                        // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.ConditionedCommand
// 0x0020
struct FConditionedCommand
{
	TArray<Zenith_ECommandCondition>                   Conditions;                                                // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UClass*>                              CommandActionClasses;                                      // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.CommandActionSettingsSummon
// 0x0018
struct FCommandActionSettingsSummon
{
	Zenith_EResummonType                               ResummonType;                                              // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	Zenith_ESpiritLocationStyle                        SpiritLocationStyle;                                       // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_K6AB[0x2];                                     // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     LocationOffset;                                            // 0x0004(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	Zenith_ESpiritEndType                              SpiritEndType;                                             // 0x0010(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_QU91[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              TimeUntilAutoEnd;                                          // 0x0014(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

};

// ScriptStruct Zenith.CommandActionSettingsSummonCastLimit
// 0x0048
struct FCommandActionSettingsSummonCastLimit
{
	struct FScriptMulticastDelegate                    OnCastLimitChangedDelegate;                                // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptMulticastDelegate                    OnCastLimitReachedDelegate;                                // 0x0010(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	Zenith_ECommandSummonLimitType                     CastLimitType;                                             // 0x0020(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_H2I9[0x3];                                     // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                MaxCastCount;                                              // 0x0024(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                              MaxTime;                                                   // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int                                                MaxAttackCount;                                            // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData_DPUI[0x18];                                    // 0x0030(0x0018) MISSED OFFSET (PADDING)

};

// ScriptStruct Zenith.InputSnapshot
// 0x0028
struct FInputSnapshot
{
	struct FVector2D                                   InputVector;                                               // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   RightInputVector;                                          // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     MoveInput;                                                 // 0x0010(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Zenith_EDirectionInputTypes                        DirectionInputType;                                        // 0x001C(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FGZD[0x3];                                     // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                CommandInputFlags;                                         // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                RawInputs;                                                 // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.DirectionInputProfile
// 0x0009
struct FDirectionInputProfile
{
	bool                                               bNone;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUp;                                                       // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDown;                                                     // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bLeft;                                                     // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bRight;                                                    // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUpRight;                                                  // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUpLeft;                                                   // 0x0006(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDownRight;                                                // 0x0007(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDownLeft;                                                 // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

};

// ScriptStruct Zenith.CommandSettings
// 0x0088
struct FCommandSettings
{
	struct FName                                       ItemRowName;                                               // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                RuntimeID;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Priority;                                                  // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
